Repository: Saydulayev/umra
Catalog: umra/*.lproj/Localizable.strings
Languages: ar, de, fr, id, ru, tr

# etiquette_manners_text5
source: A person performing Hajj and ‘Umrah should adorn themselves with noble character and treat others in the best possible manner. It is reported from Abu Dharr, may Allah be pleased with him, that the Prophet, peace and blessings be upon him, said: «Fear Allah wherever you may be! Follow a bad deed with a good one that will erase it, and behave towards people with the best of manners.» At-Tirmidhi 1987. It is also reported from ‘Abdullah ibn ‘Amr ibn al-‘As, may Allah be pleased with him and his father, that the Prophet, peace and blessings be upon him, said: «Let whoever desires to be removed from the Fire and admitted to Paradise have faith in Allah and the Last Day when death comes to them, and let them treat people the way they wish to be treated.» Muslim 1844.
de: Eine Person, die Hajj und ‘Umrah verrichtet, sollte sich mit edlen Charaktereigenschaften schmücken und andere Menschen auf die bestmögliche Weise behandeln. Es wird von Abu Dharr, möge Allah mit ihm zufrieden sein, überliefert, dass der Prophet, Allahs Segen und Frieden seien auf ihm, sagte: «Fürchte Allah, wo immer du auch bist! Folge einer schlechten Tat mit einer guten, die sie auslöscht, und halte dich im Umgang mit den Menschen an die besten Charaktereigenschaften.» At-Tirmidhi 1987. Es wird auch von ‘Abdullah ibn ‘Amr ibn al-‘As, möge Allah mit ihm und seinem Vater zufrieden sein, überliefert, dass der Prophet, Allahs Segen und Frieden seien auf ihm, sagte: «Wer möchte, dass er vom Feuer entfernt und ins Paradies eingelassen wird, der soll an Allah und den Jüngsten Tag glauben, wenn der Tod zu ihm kommt, und er soll die Menschen so behandeln, wie er möchte, dass sie ihn behandeln.» Muslim 1844.
fr: Une personne accomplissant le Hajj et la ‘Umrah doit s’embellir de nobles caractères et traiter les autres de la meilleure manière. Il est rapporté d’après Abu Dharr, qu’Allah soit satisfait de lui, que le Prophète, qu’Allah le bénisse et lui accorde la paix, a dit : «Crains Allah où que tu sois ! Suis une mauvaise action par une bonne, qui l’effacera, et adopte les meilleures manières dans tes relations avec les gens.» At-Tirmidhi 1987. Il est également rapporté d’après ‘Abdullah ibn ‘Amr ibn al-‘As, qu’Allah soit satisfait de lui et de son père, que le Prophète, qu’Allah le bénisse et lui accorde la paix, a dit : «Que celui qui désire être éloigné du Feu et admis au Paradis, croie en Allah et au Jour Dernier au moment de sa mort, et qu’il traite les gens de la manière dont il aimerait qu’ils le traitent.» Mouslim 1844.
id: Orang yang melaksanakan haji dan umrah hendaknya menghiasi dirinya dengan akhlak mulia dan bersikap baik terhadap sesama. Diriwayatkan dari Abu Dzar (semoga Allah meridhainya), Nabi (shallallahu 'alaihi wa sallam) bersabda: «Bertakwalah kepada Allah di mana pun kamu berada! Ikutilah perbuatan buruk dengan perbuatan baik yang akan menghapusnya, dan bergaullah dengan manusia dengan akhlak yang baik.» (HR. Tirmidzi, 1987) Diriwayatkan dari Abdullah bin Amr bin Al-‘Ash (semoga Allah meridhai beliau dan ayahnya), bahwa Nabi (shallallahu 'alaihi wa sallam) bersabda: «Barang siapa ingin dijauhkan dari neraka dan dimasukkan ke surga, maka hendaknya ia mati dalam keadaan beriman kepada Allah dan hari akhir, dan hendaknya ia memperlakukan manusia sebagaimana ia ingin diperlakukan.» (HR. Muslim, 1844)
ru: Человек, совершающий хадж и ’умру, должен украшаться благородными нравами и обращаться с другими людьми наилучшим образом. Сообщается со слов Абу Зарра, да будет доволен им Аллах, что пророк, да благословит его Аллах и приветствует, сказал: «Бойся Аллаха, где бы ты ни был! Вслед за дурным делом соверши благое, которое сотрет собой дурное, и придерживайся в отношениях с людьми наилучших нравов». ат-Тирмизи, 1987. Сообщается со слов ’Абдуллаха ибн ’Амра ибн аль-’Аса, да будет доволен Аллах им и его отцом, что пророк, да благословит его Аллах и приветствует, сказал: «Пусть же тот, кто желает, чтобы его удалили от Огня и ввели в Рай, окажется верующим в Аллаха и Последний день, когда придёт к нему смерть, и пусть обращается с людьми так же, как желает он, чтобы люди обращались с ним». Муслим, 1844.
tr: Hac ve umre yapan kişi, güzel ahlak sahibi olmalı ve insanlara en güzel şekilde davranmalıdır. Ebu Zerr’den (radıyallahu anh) rivayet edildiğine göre, Resulullah (sallallahu aleyhi ve sellem) şöyle buyurdu: «Nerede olursan ol, Allah’tan kork! Kötü bir amel işlersen hemen ardından onu silecek bir iyilik yap ve insanlara güzel ahlak ile muamele et.» (Tirmizî, 1987). Abdullah ibn Amr ibn Âs’tan (radıyallahu anh) rivayet edildiğine göre, Peygamber (sallallahu aleyhi ve sellem) şöyle buyurmuştur: «Kim cehennemden uzaklaştırılıp cennete girmek isterse, Allah’a ve ahiret gününe iman etmiş olarak ölsün ve insanlara, kendisine nasıl davranılmasını istiyorsa öyle davransın.» (Müslim, 1844).

# etiquette_manners_text6
source: A person performing Hajj and ‘Umrah should engage in the remembrance of Allah (dhikr), supplications to Him (du‘a), and seeking His forgiveness (istighfar). They should guard their tongue from anything except good speech. They should dedicate all their time to what will bring them benefit in this world and in the Hereafter. It is reported from Abu Hurayrah, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, said: «Let whoever believes in Allah and the Last Day speak good or remain silent.» Al-Bukhari 6018, Muslim 47. It is also reported from Ibn ‘Abbas, may Allah be pleased with him and his father, that the Messenger of Allah, peace and blessings be upon him, said: «Two blessings that many people fail to make use of: good health and free time.» Al-Bukhari 6412.
de: Eine Person, die Hajj und ‘Umrah verrichtet, sollte sich mit dem Gedenken Allahs (Dhikr), Bittgebeten zu Ihm (Du‘a) und dem Erbitten von Vergebung (Istighfar) beschäftigen. Sie sollte ihre Zunge vor allem schützen, außer vor guten Worten. Sie sollte ihre gesamte Zeit mit Dingen füllen, die ihr sowohl im diesseitigen Leben als auch im Jenseits Nutzen bringen. Es wird von Abu Hurayrah, möge Allah mit ihm zufrieden sein, überliefert, dass der Gesandte Allahs, Allahs Segen und Frieden seien auf ihm, sagte: «Wer an Allah und den Jüngsten Tag glaubt, der soll Gutes sprechen oder schweigen.» Al-Bukhari 6018, Muslim 47. Es wird auch von Ibn ‘Abbas, möge Allah mit ihm und seinem Vater zufrieden sein, überliefert, dass der Gesandte Allahs, Allahs Segen und Frieden seien auf ihm, sagte: «Zwei Gnaden, deren Wert viele Menschen nicht schätzen: Gesundheit und freie Zeit.» Al-Bukhari 6412.
fr: Une personne accomplissant le Hajj et la ‘Umrah doit s’occuper du rappel d’Allah (dhikr), des invocations adressées à Lui (du‘a) et des demandes de pardon (istighfar). Elle doit préserver sa langue de tout, sauf de bonnes paroles. Elle doit consacrer tout son temps à ce qui lui sera bénéfique, aussi bien dans cette vie que dans l’Au-delà. Il est rapporté d’après Abu Hurayra, qu’Allah soit satisfait de lui, que le Messager d’Allah, qu’Allah le bénisse et lui accorde la paix, a dit : « Que celui qui croit en Allah et au Jour Dernier dise du bien ou se taise. » Al-Boukhari 6018, Mouslim 47. Il est également rapporté d’après Ibn ‘Abbas, qu’Allah soit satisfait de lui et de son père, que le Messager d’Allah, qu’Allah le bénisse et lui accorde la paix, a dit : «Deux bienfaits dont beaucoup de gens ne profitent pas : la santé et le temps libre.» Al-Boukhari 6412.
id: Orang yang berhaji dan berumrah hendaknya banyak berdzikir, berdoa, dan memohon ampun kepada Allah. Ia harus menjaga lisannya dari ucapan yang sia-sia dan menyibukkan dirinya dengan amalan-amalan yang bermanfaat untuk dunia dan akhiratnya. Diriwayatkan dari Abu Hurairah (semoga Allah meridhainya), Rasulullah (shallallahu 'alaihi wa sallam) bersabda: «Barang siapa yang beriman kepada Allah dan hari akhir, hendaklah ia berkata baik atau diam.» (HR. Bukhari, 6018; Muslim, 47) Diriwayatkan dari Ibnu ‘Abbas (semoga Allah meridhai keduanya), Rasulullah (shallallahu 'alaihi wa sallam) bersabda: «Dua nikmat yang banyak manusia tertipu karenanya: kesehatan dan waktu luang.» (HR. Bukhari, 6412)
ru: Человек, совершающий хадж и ’умру, должен занять себя поминанием Аллаха (зикром), мольбами к Нему (ду’а) и просьбами о прощении (истигъфар). Он должен оберегать свой язык от всего, кроме благих речей. Он должен занять всё свое время тем, что обернется для него благом как в мирской жизни, так и в Последней. Сообщается со слов Абу Хурейры, да будет доволен им Аллах, что посланник Аллаха, да благословит его Аллах и приветствует, сказал: «Пусть тот, кто верует в Аллаха и в Последний день, говорит благое или молчит». аль-Бухари, 6018; Муслим, 47. Сообщается со слов ибн ’Аббаса, да будет доволен Аллах им и его отцом, что посланник Аллаха, да благословит его Аллах и приветствует, сказал: «Две милости, которых лишены многие люди: здоровье и свободное время». аль-Бухари, 6412.
tr: Hac ve umre yapan kişi, Allah'ı zikretmeye, dua etmeye ve istiğfarda bulunmaya önem vermelidir. Dilini hayırdan başka şeyle meşgul etmemeli, dünya ve ahiret hayatı için kendisine faydalı olan işlerle zamanını değerlendirmelidir. Ebu Hureyre’den (radıyallahu anh) rivayet edildiğine göre, Resulullah (sallallahu aleyhi ve sellem) şöyle buyurmuştur: «Kim Allah’a ve ahiret gününe iman ediyorsa, ya hayır söylesin ya da sussun!» (Buhari, 6018; Müslim, 47). İbn Abbas’tan (radıyallahu anh) rivayet edildiğine göre, Peygamber (sallallahu aleyhi ve sellem) şöyle buyurmuştur: «İnsanların çoğunun farkına varmadığı iki büyük nimet vardır: Sağlık ve boş vakit.» (Buhari, 6412).

# etiquette_manners_text7
source: A person performing Hajj and ‘Umrah must avoid harming others through their words or actions. The Prophet, peace and blessings be upon him, said: «A Muslim is the one from whose tongue and hands other Muslims are safe.» Al-Bukhari 10, Muslim 41. A Muslim should also be cautious not to harm others with the foul smell of cigarette smoke if they themselves smoke. Indeed, they are already obliged to quit smoking and repent to Allah. Smoking harms one’s health and wastes their wealth. A Muslim should strive to adhere to these noble moral qualities at all times and places, especially during their journey for Hajj or ‘Umrah.
de: Eine Person, die Hajj und ‘Umrah verrichtet, sollte sich davor hüten, andere Menschen durch Worte oder Taten zu verletzen. Der Prophet, Allahs Segen und Frieden seien auf ihm, sagte: «Ein Muslim ist derjenige, vor dessen Zunge und Händen andere Muslime sicher sind.» Al-Bukhari 10, Muslim 41. Ein Muslim sollte auch darauf achten, andere Muslime nicht durch den unangenehmen Geruch von Zigarettenrauch zu belästigen, falls er selbst raucht. Tatsächlich ist er ohnehin verpflichtet, das Rauchen aufzugeben und bei Allah um Vergebung zu bitten. Rauchen schadet der Gesundheit und verschwendet sein Vermögen. Ein Muslim sollte sich bemühen, die oben genannten edlen Charaktereigenschaften immer und überall zu bewahren, insbesondere während seiner Reise zum Hajj oder zur ‘Umrah.
fr: Une personne accomplissant le Hajj et la ‘Umrah doit veiller à ne pas blesser les autres par ses paroles ou ses actions. Le Prophète, qu’Allah le bénisse et lui accorde la paix, a dit : «Le musulman est celui dont les autres musulmans sont à l’abri de sa langue et de ses mains.» Al-Boukhari 10, Mouslim 41. Un musulman doit également éviter de nuire aux autres musulmans par l’odeur désagréable de la fumée de cigarette s’il fume lui-même. Il est d’ailleurs de son devoir d’abandonner la cigarette et de se repentir devant Allah. En effet, fumer nuit à la santé et gaspille les biens. Un musulman doit s’efforcer d’adopter en permanence les nobles qualités morales mentionnées ci-dessus, en tout lieu et en toute circonstance, mais particulièrement durant son voyage pour le Hajj ou la ‘Umrah.
id: Orang yang melaksanakan haji dan umrah hendaknya berhati-hati agar tidak menyakiti orang lain dengan ucapan atau perbuatannya. Nabi (shallallahu 'alaihi wa sallam) bersabda: «Muslim adalah orang yang tidak menyakiti Muslim lainnya dengan lisan dan tangannya.» (HR. Bukhari, 10; Muslim, 41) Seorang Muslim juga harus menjauhi kebiasaan merokok, apalagi sampai mengganggu orang lain dengan bau asap rokok, terlebih selama berhaji. Ia wajib meninggalkan rokok dan bertaubat kepada Allah, karena rokok membahayakan kesehatan dan merusak hartanya. Seorang Muslim hendaknya selalu menjaga akhlak-akhlak baik yang telah disebutkan, kapan saja dan di mana saja, khususnya selama perjalanan haji dan umrah.
ru: Человек, совершающий хадж и ’умру, должен остерегаться того, чтобы обидеть других людей своим словом или поступком. Пророк, да благословит его Аллах и приветствует, сказал: «Мусульманин — это тот, кто не причиняет (другим) мусульманам вреда своим языком и своими руками». аль-Бухари, 10; Муслим, 41. Пусть мусульманин также остерегается того, чтобы навредить другим мусульманам скверным запахом сигаретного дыма, если он сам курит. И это при том, что он итак обязан оставить курение и покаяться перед Аллахом. Поистине, курение вредит здоровью и уничтожает его имущество. Мусульманину следует стараться придерживаться вышеперечисленных благих нравственных качеств всегда и везде, но особенно во время своего путешествия в хадж или ’умру.
tr: Hac ve umre yapan kişi, başkalarına söz veya fiil ile zarar vermekten sakınmalıdır. Resulullah (sallallahu aleyhi ve sellem) şöyle buyurmuştur: «Müslüman, diğer Müslümanların elinden ve dilinden emin olduğu kişidir.» (Buhari, 10; Müslim, 41). Ayrıca, hac ve umre yapan kişinin, sigara içiyorsa, dumanının başkalarına zarar vermemesine dikkat etmesi gerekir. Zira zaten sigarayı bırakmak ve Allah’a tövbe etmek bir müslümana vaciptir. Çünkü sigara sağlığa zararlıdır ve kişinin malını israf etmesine sebep olur. Müslüman, burada zikredilen güzel ahlaki özellikleri her zaman ve her yerde benimsemeli, özellikle hac ve umre yolculuğunda daha fazla dikkat göstermelidir.

# hajj_umrah_virtues_text1
source: Authentic hadiths from the Messenger of Allah, peace and blessings be upon him, highlight the virtues of Hajj and ‘Umrah. Here are some of them: It is reported from Abu Hurayrah, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, said: «Performing one ‘Umrah to the next serves as expiation for the sins committed between them, and the reward for an accepted Hajj is nothing but Paradise.» Al-Bukhari 1773, Muslim 1349. It is reported from Ibn Mas‘ud, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, said: «Perform Hajj and ‘Umrah regularly, for they remove poverty and sins just as bellows remove impurities from iron, gold, and silver. And the reward for an accepted Hajj is nothing but Paradise.» At-Tirmidhi 810, An-Nasa’i 2631. It is reported from Ibn ‘Abbas, may Allah be pleased with him and his father, that the Messenger of Allah, peace and blessings be upon him, said: «Perform Hajj and ‘Umrah regularly, for they remove poverty and sins just as bellows remove impurities from iron.» An-Nasa’i 2630.
de: Über die Vorzüge von Hajj und ‘Umrah wurden authentische Hadithe vom Gesandten Allahs, Allahs Segen und Frieden seien auf ihm, überliefert. Hier sind einige davon: Es wird von Abu Huraira, möge Allah mit ihm zufrieden sein, überliefert, dass der Gesandte Allahs, Allahs Segen und Frieden seien auf ihm, sagte: «Das Verrichten von ‘Umrah bis zur nächsten ‘Umrah dient als Sühne für die zwischen ihnen begangenen Sünden, und für einen makellosen Hajj gibt es keine andere Belohnung als das Paradies.» Al-Bukhari 1773, Muslim 1349. Es wird von Ibn Mas‘ud, möge Allah mit ihm zufrieden sein, überliefert, dass der Gesandte Allahs, Allahs Segen und Frieden seien auf ihm, sagte: «Verrichtet Hajj und ‘Umrah regelmäßig, denn sie entfernen Armut und Sünden, so wie Blasebälge Verunreinigungen von Eisen, Gold und Silber entfernen. Und für einen makellosen Hajj gibt es keine andere Belohnung als das Paradies.» At-Tirmidhi 810, An-Nasai 2631. Es wird von Ibn ‘Abbas, möge Allah mit ihm und seinem Vater zufrieden sein, überliefert, dass der Gesandte Allahs, Allahs Segen und Frieden seien auf ihm, sagte: «Verrichtet Hajj und ‘Umrah regelmäßig, denn sie entfernen Armut und Sünden, so wie Blasebälge Verunreinigungen von Eisen entfernen.» An-Nasai 2630.
fr: Les mérites du Hajj et de la ‘Umrah sont mentionnés dans des hadiths authentiques rapportés du Messager d’Allah, qu’Allah le bénisse et lui accorde la paix. En voici quelques-uns : Il est rapporté d’après Abu Hurayra, qu’Allah soit satisfait de lui, que le Messager d’Allah, qu’Allah le bénisse et lui accorde la paix, a dit : «L’accomplissement d’une ‘Umrah jusqu’à la suivante expie les péchés commis entre elles, et le Hajj irréprochable n’a d’autre récompense que le Paradis.» Al-Boukhari 1773, Mouslim 1349. Il est rapporté d’après Ibn Mas‘ud, qu’Allah soit satisfait de lui, que le Messager d’Allah, qu’Allah le bénisse et lui accorde la paix, a dit : «Accomplissez régulièrement le Hajj et la ‘Umrah, car ils éliminent la pauvreté et les péchés, tout comme le soufflet du forgeron élimine les impuretés du fer, de l’or et de l’argent. Et le Hajj irréprochable n’a d’autre récompense que le Paradis.» At-Tirmidhi 810, An-Nassa’i 2631. Il est rapporté d’après Ibn ‘Abbas, qu’Allah soit satisfait de lui et de son père, que le Messager d’Allah, qu’Allah le bénisse et lui accorde la paix, a dit : «Accomplissez régulièrement le Hajj et la ‘Umrah, car ils éliminent la pauvreté et les péchés, tout comme le soufflet du forgeron élimine les impuretés du fer.» An-Nassa’i 2630.
id: Keutamaan ibadah haji dan umrah telah dijelaskan dalam hadis-hadis shahih dari Rasulullah shallallahu 'alaihi wa sallam. Berikut beberapa di antaranya: Diriwayatkan dari Abu Hurairah (semoga Allah meridhainya), bahwa Rasulullah shallallahu 'alaihi wa sallam bersabda: «Umrah yang satu ke umrah berikutnya menjadi penghapus dosa-dosa yang dilakukan di antara keduanya. Dan haji yang mabrur tidak ada balasan baginya kecuali surga.» (HR. Bukhari, 1773; Muslim, 1349) Diriwayatkan dari Ibnu Mas’ud (semoga Allah meridhainya), bahwa Rasulullah shallallahu 'alaihi wa sallam bersabda: «Lakukanlah haji dan umrah secara berulang-ulang, karena keduanya menghapus kefakiran dan dosa sebagaimana alat pandai besi menghilangkan karat dari besi, emas, dan perak. Dan haji yang mabrur tidak ada ganjarannya kecuali surga.» (HR. Tirmidzi, 810; An-Nasa’i, 2631) Diriwayatkan dari Ibnu ‘Abbas (semoga Allah meridhainya dan ayahnya), bahwa Rasulullah shallallahu 'alaihi wa sallam bersabda: «Lakukanlah haji dan umrah secara berulang-ulang, karena keduanya menghilangkan kefakiran dan dosa seperti alat peniup api menghilangkan kotoran dari besi.» (HR. An-Nasa’i, 2630)
ru: О достоинстве хаджа и ’умры пришли достоверные хадисы от посланника Аллаха, да благословит его Аллах и приветствует. Приведем некоторые из них: Сообщается со слов Абу Хурейры, да будет доволен им Аллах, что посланник Аллаха, да благословит его Аллах и приветствует, сказал: «Совершение ‘умры до следующей умры служит искуплением совершенных между ними грехов, что же касается безупречного хаджа, то нет за него иного воздаяния, кроме Рая». аль-Бухари, 1773; Муслим, 1349. Сообщается со слов ибн Мас’уда, да будет доволен им Аллах, что посланник Аллаха, да благословит его Аллах и приветствует, сказал: «Совершайте хадж и ’умру регулярно, ибо они удаляют бедность и грехи подобно тому, как кузнечные меха удаляют шлаки с железа, золота и серебра. А за безупречный хадж нет иной награды, кроме Рая». ат-Тирмизи, 810; ан-Насаи, 2631. Сообщается со слов ибн ’Аббаса, да будет доволен им Аллах и его отцом, что посланник Аллаха, да благословит его Аллах и приветствует, сказал: «Совершайте хадж и ’умру регулярно, ибо они удаляют бедность и грехи подобно тому, как кузнечные меха удаляют шлаки с железа». ан-Насаи, 2630.
tr: Hac ve umrenin fazileti hakkında Resulullah’tan (sallallahu aleyhi ve sellem) sahih hadisler rivayet edilmiştir. Bunlardan bazılarını zikredelim: Ebu Hureyre’den (radıyallahu anh) rivayet edildiğine göre, Resulullah (sallallahu aleyhi ve sellem) şöyle buyurmuştur: «Bir umreden diğerine kadar işlenen günahlar affedilir. Makbul bir haccın karşılığı ise ancak cennettir.» (Buhari, 1773; Müslim, 1349). Abdullah ibn Mes’ud’dan (radıyallahu anh) rivayet edildiğine göre, Resulullah (sallallahu aleyhi ve sellem) şöyle buyurmuştur: «Hac ve umreyi peş peşe yapınız. Çünkü bu ikisi, demircinin körüğü demir, altın ve gümüşün paslarını giderdiği gibi fakirliği ve günahları giderir. Makbul bir haccın karşılığı ise ancak cennettir.» (Tirmizî, 810; Nesâî, 2631). İbn Abbas’tan (radıyallahu anh) rivayet edildiğine göre, Resulullah (sallallahu aleyhi ve sellem) şöyle buyurmuştur: «Hac ve umreyi peş peşe yapınız. Çünkü bunlar, demircinin körüğünün demirden kiri giderdiği gibi fakirliği ve günahları giderir.» (Nesâî, 2630).
