Repository: Saydulayev/umra
Catalog: umra/*.lproj/Localizable.strings
Languages: ar, de, fr, id, ru, tr

# app_name
source: Umra
ar: العمرة
id: Umrah
tr: Umre

# main_screen_name_string
source: UMRA
ar: العمرة
id: UMRAH
tr: UMRE

# title_black_stone_screen
source: Return to the Black Stone
ar: العودة إلى الحجر الأسود
de: Zurück zum schwarzen Stein
fr: Retour à la Pierre Noire
id: Kembali ke Hajar Aswad
ru: Возврат к Черному камню
tr: Hacerü'l-Esved'e Dönüş

# title_place_ibrohim_stand_screen
source: The place where Ibrahim stood
ar: مقام إبراهيم
de: Ort des Propheten Ibrahims Stand
fr: Station d'Ibrahim
id: Maqam Ibrahim
ru: Место стояния Ибрахима
tr: Makâm-ı İbrahim

# title_round_kaaba_screen
source: Tawaf
ar: الطواف حول الكعبة
id: Tawaf Ka'bah
ru: Обход Каабы
tr: Kâbe'yi Tavaf

# title_safa_and_marva_screen
source: Safa and Marwa
ar: السعي بين الصفا والمروة
de: Safa und Marwa
fr: Safa et Marwa
id: Safa dan Marwah
ru: Сафа и Марва
tr: Safa ve Merve

# title_settings_screen
source: Settings
ar: الإعدادات
de: Einstellungen
fr: Paramètres
id: Pengaturan
ru: Настройки
tr: Ayarlar

# title_shave_head_screen
source: Shave head or cut hair
ar: حلق الرأس
de: Kopf rasieren oder Haare kürzen
fr: Rasage de la tête
id: Mencukur Rambut
ru: Бритье головы
tr: Saç Tıraşı

# title_water_zamzam_screen
source: Drinking Zamzam water
ar: شرب ماء زمزم
de: Trinken des Zamzam-Wassers
fr: Boire de l'eau de Zamzam
id: Meminum Air Zamzam
ru: Питье воды Замзам
tr: Zemzem İçme

# title_link_book_screen
source: Books
ar: الكتب
de: Bücher
fr: Livres
id: Buku
ru: Книги
tr: Kitaplar

# into the state of Ihram
source: Enter the state of Ihram at the designated place (Miqat).
ar: ادخل في حالة الإحرام في المكان المخصص لذلك (الميقات).
de: Treten Sie am Ort des Mikats in den Zustand des Ihrams ein.
fr: Entrez dans l'état d'Ihram à l'endroit prévu à cet effet (Miqat).
id: Masuklah ke dalam keadaan Ihram di tempat yang telah ditentukan (Miqat).
ru: Войдите в состояние ихрама в предназначенном для этого месте (микат).
tr: Mikat noktasında ihrama girin.

source: When entering the state of Ihram, say:
ar: عند الدخول في حالة الإحرام، قل:
de: Wenn Sie in den Zustand des Ihram eintreten, sagen Sie:
fr: Lors de l'entrée en état d'Ihram, dites:
id: Ketika memasuki keadaan Ihram, ucapkan:
ru: При вхождении в состояниe ихрама произнесите:
tr: İhrama girerken şunu söyleyin:

# Turn your face towards the Qiblah and say:
source: Labbayka Allahumma bi-´umrah. Turn your face towards the Qibla and say:
ar: توجه بوجهك نحو القبلة وقل:
de: Labbayka Allahumma bi-umrah. Wenden Sie Ihr Gesicht in Richtung Qibla und sagen Sie:
fr: Labbayka Allahumma bi-‘Umrah. Tournez votre visage vers la Qiblah et dites:
id: Labbayk Allahumma bi 'Umrah. Hadapkanlah wajah ke arah kiblat dan ucapkan:
ru: Ляббайка Аллоhумма би-'умраh. Обратитесь лицом к кибле и скажите:
tr: Labbayka Allahumma bi-´umrah. Kıbleye yönelin ve şunu söyleyin:

# O Allah, this Umrah is without any ostentation or fame
source: Allahumma hazihi 'umrah, la riya'a fiha wa la sum'ah. O Allah, this Umrah - there is no showing off or seeking fame in it! Then begin loudly reciting the Talbiyah:
ar: ثم ابدأ بالتلبية بصوت مرتفع:
de: Allahumma hazihi 'umrah, la riya'a fiha wa la sum'ah. Oh Allah, diese Umra ist ohne jegliche Prahlerei oder Ruhm! Dann beginnen Sie laut die Talbiyah auszusprechen:
fr: Allahumma hadhihi 'umrah la riya'a fiha wa la soum'a Ô Allah, cette ‘Umrah – il n’y a ni ostentation ni recherche de renommée en elle! Ensuite, commencez à réciter à haute voix la Talbiyah:
id: Allahumma hadzihil 'Umrata la riyaa-a fiiha wa laa sum'ah. Ya Allah, Umrah ini tidak ada unsur riya (pamer) di dalamnya dan tidak pula untuk mencari ketenaran! Kemudian mulailah mengucapkan Talbiyah dengan suara keras:
ru: Аллоhумма hазиhи 'умра ля рийа’ фи-hа ва ля сум'аh О Аллах, эта Умра — нет в ней показухи и стремления к славе! Затем начните громко произносить тальбию:
tr: Allahumma hazihi 'umrah, la riya'a fiha wa la sum'ah. Ey Allah’ım! Bu umre, gösteriş ve şöhret için değildir! Daha sonra yüksek sesle telbiyeye başlayın:

# Labbayka Allahumma labbayk
source: Labbayka Allahumma labbayk! Labbayka laa shariika laka labbayka! Innal hamda wanni'mata laka wal mulk, laa shariika lak («Here I am, O Allah, here I am! Here I am, there is no partner for You, here I am! Verily, all praise, grace, and sovereignty belong to You. You have no partner.»). Upon reaching the sacred territory of Mecca and seeing the houses of Mecca, one should stop reciting the Talbiyah.
ar: عند الوصول إلى حدود الحرم ورؤية بيوت مكة، توقف عن التلبية.
de: Labbayka Allahumma labbayk! Labbayka laa shariika laka labbayka! Innal hamda wanni'mata laka wal mulk, laa shariika lak «Hier bin ich, o Allah, hier bin ich! Hier bin ich, und Du hast keinen Teilhaber, hier bin ich! Wahrlich, alles Lob, alle Huld und die Herrschaft gehören allein Dir. Du hast keinen Teilhaber!» Nachdem man das heilige Gebiet von Mekka erreicht hat und die Häuser von Mekka sieht, sollte man aufhören, die Tahlbiyah auszusprechen.
fr: Labbayka Allahumma labbayk! Labbayka la sharika laka labbayk! Innal hamda wan ni‘mata laka wal mulk, la sharika laka. «Me voici répondant à Ton appel, ô Allah ! Tu n’as aucun associé, me voici ! La louange et le bienfait T’appartiennent, ainsi que la Royauté. Tu n’as aucun associé!». Après avoir atteint la zone sacrée de La Mecque et aperçu les maisons de La Mecque, cessez de réciter la Talbiyah.
id: Labbayk Allahumma labbayk! Labbayka laa syariika laka labbayk! Innal hamda wan-ni'mata laka wal-mulk, laa syariika lak. «Aku memenuhi panggilan-Mu, ya Allah! Aku memenuhi panggilan-Mu! Aku memenuhi panggilan-Mu, tiada sekutu bagi-Mu! Aku memenuhi panggilan-Mu! Sesungguhnya segala puji, nikmat, dan kekuasaan hanya milik-Mu. Tiada sekutu bagi-Mu!». Ketika mencapai tanah suci Mekah dan melihat rumah-rumah Mekah, hentikan bacaan Talbiyah.
ru: Ляббайка Ллоhумма ляббайка! Ляббайка ляя шариика ляка ляббайка! Инналь хьамда ван ни'мата ляка валь мульк, ляя шариика ляк. «Вот я перед Тобой, о, Аллаh! Вот я перед Тобой! Вот я перед Тобой, и нет у Тебя сотоварища! Вот я перед Тобой! Поистине, Тебе надлежит хвала, и Тебе принадлежит милость и владычество! Нет у Тебя сотоварища!». Достигнув заповедной территории Мекки и увидев дома Мекки, следует прекратить произносить тальбию.
tr: Labbayka Allahumma labbayk! Labbayka laa shariika laka labbayka! Innal hamda wanni'mata laka wal mulk, laa shariika lak «Buyur Allah’ım, buyur! Buyur, Senin hiçbir ortağın yoktur! Buyur! Şüphesiz hamd, nimet ve mülk yalnızca Sana aittir! Senin hiçbir ortağın yoktur!». Mekke'nin Harem bölgesine ulaştığınızda ve Mekke'nin evlerini gördüğünüzde telbiyeyi bırakmalısınız.

# Entering the Sacred Mosque from the right foot
source: Upon entering the Sacred Mosque with the right foot, say:
ar: عند دخول المسجد الحرام بالقدم اليمنى، قل:
de: Beim Betreten der Heiligen Moschee mit dem rechten Fuß sagen Sie:
fr: En entrant dans la Mosquée Sacrée avec le pied droit, dites:
id: Ketika memasuki Masjidil Haram dengan kaki kanan, ucapkan:
ru: Войдя в Заповедную мечеть с правой ноги, скажите:
tr: Mescid-i Haram’a sağ ayak ile girerken şunu söyleyin:

# entering the Sacred Mosque
source: Allahumma, solli ´ala Muhammadin wa sallim! Allahumma - ftah li abwaba rohmati-ka! O Allah, bless Muhammad and grant him peace! O Allah, open for me the gates of Your mercy!
de: Allahumma, solli ´ala Muhammadin wa sallim! Allahumma - ftah li abwaba rohmati-ka! Oh Allah, segne Muhammad und schenke ihm Frieden! Oh Allah, öffne mir die Tore deiner Barmherzigkeit!
fr: Allahumma solli ‘ala Muhammad wa sallim! Allahumma-ftah li abwaba rohmatika! Ô Allah, bénis Muhammad et accorde-lui la paix! Ô Allah, ouvre pour moi les portes de Ta miséricorde!
id: Allahumma shalli 'alaa Muhammadin wa sallim! Allahummaftah lii abwaaba rahmatik! Ya Allah, limpahkanlah salawat dan salam kepada Nabi Muhammad! Ya Allah, bukakanlah untukku pintu-pintu rahmat-Mu!
ru: Аллоhумма, солли 'аля Мухьаммадин ва саллим! Аллоhумма - фтахь ли абваба рохьмати-ка! О Аллах, благослови Мухаммада и ниспошли ему мир! О Аллах, открой для меня врата Своего милосердия!
tr: Allahumma, solli ´ala Muhammadin wa sallim! Allahumma - ftah li abwaba rohmati-ka! Ey Allah’ım! Muhammed’e salât ve selam eyle! Ey Allah’ım! Bana rahmet kapılarını aç!

# Conditioning for Hajj or Umrah.
source: Conditions for performing Hajj or Umrah.
ar: اشتراط الحج أو العمرة.
de: Bedingungen für die Hajj oder Umrah.
fr: Condition pour le Hajj ou l’‘Umrah.
id: Mensyaratkan dalam Haji atau Umrah.
ru: Обусловливание Хаджа или Умры.
tr: Hac veya Umre için şart koşma.

# If a pilgrim fears that some reason may prevent them from completing the Hajj
source: If a pilgrim is afraid that something might prevent them from completing the Hajj, such as illness or fear, then before reciting the Talbiyah, they may condition their intention for Hajj before the Almighty Lord by saying what the Prophet, peace and blessings be upon him, taught them:
ar: إذا خشي الحاج أن يمنعه سبب ما من إتمام الحج – سواء كان مرضًا أو خوفًا – فيمكنه عند التلبية أن يشترط لله تعالى قائلاً ما علمنا إياه الرسول صلى الله عليه وسلم:
de: Wenn ein Pilger befürchtet, dass irgendein Grund ihn daran hindern kann, den Hajj bis zum Ende zu vollenden - sei es Krankheit oder Angst - kann er vor der Tahlbiyah was der Gesandte gelehrt hat, Friede und Segen Allahs sei auf ihm aussprechen :
fr: Si un pèlerin craint qu’une raison quelconque puisse l’empêcher de compléter le Hajj – que ce soit une maladie ou une crainte, avant de réciter la Talbiyah, il peut conditionner son Hajj devant le Seigneur Tout-Puissant en disant ce qu’a enseigné le Messager, que la paix et les bénédictions d’Allah soient sur lui:
id: Jika seseorang khawatir ada sesuatu yang akan menghalanginya dari menyempurnakan ibadah haji, baik karena sakit atau takut, maka sebelum membaca Talbiyah ia boleh mensyaratkan haji atau umrahnya kepada Allah dengan membaca apa yang diajarkan oleh Rasulullah shallallahu 'alaihi wa sallam, yaitu:
ru: Если паломник опасается, что какая-либо причина может помешать ему совершить хадж до конца – будь то болезнь или страх, то до произнесении тальбии он может обусловить свой хадж пред Всевышним Господом, сказав то, чему научил посланник, да пребудет над Ним мир и благословение Аллаха:
tr: Eğer bir hacı, hastalık veya başka bir sebeple haccını tamamlayamayacağından korkuyorsa, telbiyeyi söylemeden önce, Allah Resulü’nün (sallallâhu aleyhi ve sellem) öğrettiği şekilde niyetini şartlı olarak yapabilir:

# Ihram text1
source: «Allahumma mahilli haysu habastani» «O Allah, my place of entering into Ihram is wherever You have detained me». This hadith is considered sahih (authentic). See also «Sahih Abi Dawud» (1776). Therefore, if a pilgrim acts in this way and is prevented by something or falls ill, then he is allowed to exit the state of ihram during the performance of hajj or umrah, and he will not have to sacrifice an animal as atonement and repeat the hajj, unless it was his first mandatory hajj, which in this case he would have to repeat again.
ar: هذا الحديث متفق عليه. انظر أيضًا «صحيح أبي داود» (1776). لذلك، إذا فعل الحاج ذلك وتم إعاقته أو أصابه مرض، فإنه يجوز له التحلل من الإحرام سواء في الحج أو العمرة، ولا يلزمه ذبح فدية أو إعادة الحج، إلا إذا كان هذا حجه الأول المفروض، ففي هذه الحالة يجب عليه إعادة الحج.
de: «Allahumma mahilli haysu habastani» «O Allah, mein Eingangsort zur Heiligen Stätte ist dort, wo Du mich aufhältst.». Diese Hadith ist bestätigt. Siehe auch «Sahih Abi Dawud» (1776). Deshalb, wenn ein Pilger so handelt und etwas ihn aufhält oder er krank wird, ist es ihm erlaubt, den Zustand des Ihrams zu verlassen, wenn er die Hadsch oder Umra durchführt, und er muss kein Opfertier als Sühne bringen und die Hadsch nicht erneut wiederholen, es sei denn, dies war seine erste verpflichtende Hadsch, die er dann wiederholen müsste.
fr: «Allahumma mahilli haythu habastani» «Ô Allah, mon lieu de sortie de l'Ihram est là où Tu m’as retenu». Ce hadith est unanimement rapporté. Voir également «Sahih Abi Dawud» (1776). Ainsi, si le pèlerin agit ainsi et que quelque chose le retient ou s’il tombe malade, il lui est permis de sortir de l’état d’Ihram pour le Hajj ou l’‘Umrah, et il n’aura pas besoin de sacrifier un animal en expiation ni de refaire le Hajj, sauf si c’était son premier Hajj obligatoire, qu’il devra alors accomplir de nouveau.
id: «Allahumma mahilli haitsu habastani» «Ya Allah, tempat bertahallul-ku adalah di mana saja Engkau menahanku». Hadis ini muttafaq 'alaih. Lihat juga dalam Shahih Abu Dawud (1776). Jika seseorang melakukan ini, lalu dia tertahan atau sakit, maka ia dibolehkan keluar dari ihram ketika sedang berhaji atau umrah tanpa harus menyembelih hewan dam atau mengulang haji, kecuali jika ini merupakan haji wajib pertamanya, yang dalam kondisi tersebut ia harus mengulanginya di lain waktu.
ru: «Аллоhумма махьилли хьайсу хьабастани» «О Аллах, мое место вхождения в ихрам там, где Ты меня задержал». Этот хадис является согласованным. См. также «Сахих Аби Дауд» (1776). Поэтому, если паломник поступит так, и его что-то задержит или он заболеет, то ему разрешено выйти из состояния ихрама при совершении хаджа или умры, и ему не надо будет приносить в жертву животное в качестве искупления и снова повторять хадж, если только это не был его первый хадж, являющийся обязательным, который в таком случае следует совершить заново.
tr: «Allahumma mahilli haysu habastani» «Ey Allah’ım! Eğer beni bir şey engellerse, ihramdan çıkışım burada olsun.» Bu hadis, sahih olarak kabul edilmiştir. Ayrıca bkz. “Sahîh Ebû Dâvûd” (1776). Bundan dolayı, eğer hacı bu şekilde niyet eder ve bir engel çıkarsa ya da hastalanırsa, hac veya umre ibadetini tamamlamadan ihramdan çıkabilir. Bu durumda ceza olarak kurban kesmesi gerekmez ve yeniden hac yapmasına da gerek yoktur. Ancak bu onun farz olan ilk haccı ise, bu durumda onu tekrar yapması gerekir.

# Kaaba text1
source: Circumambulation (Tawaf) around the Kaaba.
ar: الطواف حول الكعبة
de: Die Umrundung der Kaaba
fr: La Tawaf (Sept tours autour de la Kaaba).
id: Tawaf Ka'bah
ru: Обход Каабы
tr: Kâbe’yi Tavaf

# Kaaba text2
source: Begin the sevenfold circumambulation (Tawaf) around the Kaaba After that, the pilgrim touches the Black Stone with their hand and kisses it. If it's not possible to kiss the Black Stone, one should touch it with their hand. If it is not possible to touch and kiss the Black Stone, then face it, point to it with your right hand and say «Allahu Akbar» (Allah is Great). (All of this should be done during each round of circumambulation around the Kaaba.)
ar: ابدأ بالطواف حول الكعبة سبع مرات (طواف) بعد ذلك، يقوم الحاج بلمس الحجر الأسود بيده وتقبيله. إذا لم يكن بالإمكان تقبيل الحجر الأسود، يمكن لمس الحجر الأسود بيده. إذا لم يكن بالإمكان لمس الحجر الأسود أو تقبيله، فليتوجه إليه بوجهه ويشير إليه بيده اليمنى ويكبر قائلاً: «الله أكبر». (يتم هذا في كل شوط من أشواط الطواف حول الكعبة.)
de: Beginnen Sie mit der siebenfachen Umrundung der Kaaba (Tawaf). Während der gesamten Umrundung des Kaaba, angefangen von ihrem Anfang bis zu ihrem Abschluss, sollten Männer ihre rechte Schulter entblößen. Danach berührt der Pilger den Schwarzen Stein mit seiner Hand und küsst ihn. Wenn es nicht möglich ist, den Schwarzen Stein zu küssen, sollten Sie ihn mit Ihrer Hand berühren. Wenn es nicht möglich ist, den Schwarzen Stein zu berühren oder zu küssen, dann richten Sie Ihr Gesicht darauf, zeigen Sie mit Ihrer rechten Hand darauf und sagen Sie den Takbir: «Allahu Akbar» (Allah ist der Größte). (Dies sollte während jeder Runde bei der Umrundung der Kaaba geschehen.)
fr: Commencez sept tours autour de la Kaaba (tawaf). Dès le début de cet itinéraire autour de la Kaaba jusqu'à son achèvement, les hommes découvrent leur épaule droite. Après cela, le pèlerin touche la Pierre Noire avec sa main et l'embrasse. S'il n'est pas possible d'embrasser la pierre noire, il faut la toucher avec la main. S'il n'est pas possible de toucher et d'embrasser la pierre noire, il faut la regarder en face, la pointer de la main droite et dire le takbir : «Allahu akbar», Allah est grand. (Tout cela doit être fait à chaque tour de la Kaaba.)
id: Mulailah melakukan tawaf (mengelilingi Ka'bah) sebanyak tujuh putaran. Sejak awal hingga selesai tawaf, laki-laki disunnahkan membuka pundak kanan (Idhtiba'). Setelah itu, jamaah dianjurkan menyentuh Hajar Aswad dengan tangan dan menciumnya. Jika tidak memungkinkan mencium Hajar Aswad, cukup menyentuhnya dengan tangan. Jika tidak memungkinkan menyentuh atau mencium Hajar Aswad, maka hadapilah Hajar Aswad, tunjuklah dengan tangan kanan sambil mengucapkan takbir: «Allahu Akbar» (Allah Maha Besar). (Hal ini dilakukan setiap kali memulai putaran tawaf.)
ru: Начните семикратный обход Каабы (таваф). С самого начала этого обхода Каабы и до его завершения мужчины обнажают правое плечо. После этого паломник прикасается к Черному камню своей рукой и целует его. Если нет возможности поцеловать Черный камень, следует прикоснуться к Черному камню своей рукой. Если нет возможности прикоснуться и поцеловать Черный камень, то обратитесь к нему лицом, укажите на него правой рукой и произнесите такбир: «Аллаhу акбар» Аллах Велик. (Все это следует делать во время каждого круга при обходе Ка’бы.)
tr: Kâbe etrafında yedi kez tavaf etmeye başlayın (Tavaf). Bu tavafın başlangıcından bitimine kadar erkekler sağ omuzlarını açık bırakmalıdır. Bundan sonra, hacı Kara Taş’a (Hacerü'l-Esved) eliyle dokunur ve onu öper. Eğer Kara Taş’ı öpmek mümkün değilse, ona eliyle dokunmalıdır. Eğer Kara Taş’a dokunmak ve öpmek mümkün değilse, o zaman ona yönelin, sağ elinizle işaret edin ve «Allahu Akbar» (Allah en büyüktür) deyin. (Bütün bunlar Kâbe’yi tavaf ederken her turda yapılmalıdır.)

# Kaaba text3
source: Begin the sevenfold circumambulation (tawaf) of the Kaaba from the Black Stone. Completing a circuit from the Black Stone to the Black Stone is counted as one circuit. At the start of each new circuit, point with your right hand to the Black Stone and say the takbir. From the beginning of this tawaf until its completion, men should bare their right shoulder. For the first three circuits from the Black Stone to the Black Stone, men should walk quickly, and for the remaining four, they should walk at a normal pace. If possible, touch the Yemeni corner during each circuit. Every time you pass between the Yemeni corner and the Black Stone, say:
ar: ابدأ الطواف حول الكعبة سبع مرات من عند الحجر الأسود. يُعتبر المرور من الحجر الأسود إلى الحجر الأسود شوطاً واحداً. عند بدء شوط جديد، أشر بيدك اليمنى إلى الحجر الأسود وكبِّر. منذ بداية الطواف وحتى نهايته، يكشف الرجال عن الكتف الأيمن. في الأشواط الثلاثة الأولى، يجب على الرجال المشي بخطوات سريعة، وفي الأشواط الأربعة المتبقية بخطوات عادية. إذا أمكن، قم بلمس الركن اليماني أثناء كل شوط. وفي كل مرة تمر بين الركن اليماني والحجر الأسود، قل:
de: Beginnen Sie den siebenfachen Umrundung des Kaaba (Tawaf) vom Schwarzen Stein aus. Das Passieren vom Schwarzen Stein zum Schwarzen Stein gilt als eine Runde. Wenn Sie eine neue Runde beginnen, zeigen Sie mit Ihrer rechten Hand auf den Schwarzen Stein und sagen Sie Takbir. Die ersten drei Runden, vom Schwarzen Stein zum Schwarzen Stein, sollten Männer mit schnellem Schritt gehen, während die verbleibenden vier Runden im normalen Tempo durchgeführt werden. Wenn möglich, berühren Sie während jeder Runde die Jemen-Ecke. Jedes Mal, wenn Sie zwischen der Jemen-Ecke und dem Schwarzen Stein vorbeigehen, sagen Sie:
fr: Commencez sept tours autour de la Kaaba (tawaf) à partir de la Pierre Noire. Le trajet de la Pierre Noire à la Pierre Noire compte pour un tour. En débutant un nouveau tour, pointez la Pierre Noire de la main droite et récitez le takbir. Les trois premiers tours, de la Pierre Noire à la Pierre Noire, les hommes doivent marcher d'un pas rapide, et les quatre autres tours à un pas normal. Si possible, touchez l'angle yéménite pendant chaque tour. Chaque fois que vous passez entre l'angle yéménite et la Pierre Noire, dites :
id: Mulailah tawaf sebanyak tujuh putaran dimulai dari Hajar Aswad. Satu putaran dihitung mulai dari Hajar Aswad sampai kembali ke Hajar Aswad. Setiap kali memulai putaran baru, tunjuklah Hajar Aswad dengan tangan kanan sambil mengucapkan takbir. Tiga putaran pertama dari Hajar Aswad hingga Hajar Aswad, laki-laki disunnahkan berjalan cepat (raml), dan empat putaran sisanya berjalan biasa. Usahakan menyentuh Rukun Yamani setiap putaran bila memungkinkan. Setiap kali melewati antara Rukun Yamani dan Hajar Aswad, bacalah doa berikut:
ru: Начните семикратный обход Каабы (таваф) от Чёрного камня. Прохождение от Чёрного камня до Чёрного камня считается за один круг. Начиная новый круг, укажите правой рукой на Чёрный камень и произнесите такбир. Первые три круга, от Чёрного камня до Чёрного камня, мужчинам необходимо пройти быстрым шагом, а оставшиеся четыре — обычным шагом. При возможности прикасайтесь к йеменскому углу во время каждого круга. Всякий раз, проходя между йеменским углом и Чёрным камнем, следует сказать:
tr: Kâbe’nin tavafına Kara Taş’tan başlayın. Kara Taş’tan Kara Taş’a bir tur tamamlanmış sayılır. Her yeni tura başlarken sağ elinizle Kara Taş’a işaret edin ve tekbir getirin. İlk üç turda, Kara Taş’tan Kara Taş’a hızlı adımlarla yürümeleri, geri kalan dört turda ise normal tempoda yürümeleri gerekir. Mümkünse, her turda Yemen Köşesi’ne dokunun. Yemen Köşesi ile Kara Taş arasından her geçişinizde şu duayı okuyun:

# Kaaba text4
source: Rabbana, atina fid-dunya hasanatan wa fil-akhiroti hasanatan wa qina azaba-n-nar («Our Lord, grant us the good of this world and the good of the Hereafter, and protect us from the torment of the Fire!», Surah Al-Baqarah, verse 201).
ar: سورة البقرة، الآية 201.
de: Rabbana, atina fid-dunya hasanatan wa fil-akhiroti hasanatan wa qina azaba-n-nar Unser Herr! Gib uns Gutes in dieser Welt und Gutes im Jenseits und schütze uns vor der Pein des Feuers! (Surah Die Kuh, Vers 201).
fr: Rabbana, atina fi-d-dunya khyasanatan va fil-ahiroti khyasanatanan va k'ina ´azaba-n-n-nar «Ô notre Seigneur! Accorde-nous une belle part dans l'ici-bas, une belle part dans l'au-delà et protège-nous du châtiment du feu!», sourate «La Vache», verset 201.
id: Rabbanaa aatina fid-dunyaa hasanah wa fil-aakhirati hasanah wa qinaa 'adzaaban-naar «Ya Tuhan kami, berilah kami kebaikan di dunia dan kebaikan di akhirat, serta lindungilah kami dari siksa api neraka!» (QS. Al-Baqarah: 201)
ru: Роббана, атина фи-д-дунья хьасанатан ва филь-ахироти хьасанатан ва къына 'азаба-н-нар «Господь наш! Одари нас добром в этом мире и добром в Последней жизни и защити нас от мучений в Огне!», сура “Корова“, аят 201.
tr: Rabbana, atina fid-dunya hasanatan wa fil-akhiroti hasanatan wa qina azaba-n-nar «Rabbimiz! Bize dünyada iyilik ver, ahirette de iyilik ver ve bizi ateşin azabından koru!», (Bakara Suresi, 201. ayet).

# Prayer after Tawaf of Kaaba.
source: Prayer after completing Tawaf around the Kaaba
ar: صلاة بعد الطواف حول الكعبة.
de: Gebet nach der Umkreisung der Kaaba.
fr: La prière après le Tawaf de la Kaaba.
id: Shalat dua rakaat setelah Tawaf Ka'bah.
ru: Намаз после обхода Каабы.
tr: Tavaftan sonra namaz.
