Repository: Saydulayev/umra
Catalog: umra/*.lproj/Localizable.strings
Languages: ar, de, fr, id, ru, tr

# hajj_umrah_obligation_evidence_umrah_obligation
source: As for ‘Umrah, its obligation is indicated by the following hadiths: 1 — It is reported that ‘Aishah, may Allah be pleased with her, once asked: «O Messenger of Allah, are women required to perform jihad?» The Messenger of Allah, peace and blessings be upon him, replied: «Yes, they are required to perform a jihad in which there is no fighting, and that is Hajj and ‘Umrah.» Ahmad 6/165; Ibn Majah 2901. Commenting on this hadith, Ibn Khuzaymah, may Allah have mercy on him, said: «The Prophet's words, peace and blessings be upon him: “...they are required to perform a jihad in which there is no fighting, and that is Hajj and ‘Umrah” clarify that ‘Umrah is as obligatory as Hajj.» See «Sahih Ibn Khuzaymah,» Hadith No. 3074. 2 — It is reported from ‘Umar, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, said: «The essence of Islam is to bear witness that there is no deity worthy of worship except Allah, and that Muhammad is the Messenger of Allah, to establish prayer, to give zakat, to perform Hajj and ‘Umrah, to perform the major purification after sexual impurity, to perform minor ablution properly, and to fast during Ramadan.» See «Sahih Ibn Khuzaymah,» Hadith No. 3065. This hadith is also found in Ad-Daraqutni 2/282. 3 — It is reported from Abu Razin Al-‘Uqayli that he once came to the Prophet, peace and blessings be upon him, and said: «O Messenger of Allah, my father is very old and cannot perform Hajj or ‘Umrah, nor can he sit firmly in a saddle.» The Prophet, peace and blessings be upon him, replied: «Perform Hajj and ‘Umrah on behalf of your father.» At-Tirmidhi 930. 4 — It is reported from As-Subay‘ bin Ma‘bad that he once said to ‘Umar ibn Al-Khattab, may Allah be pleased with him: «O Commander of the Believers, I was a Bedouin and practiced Christianity. Then I embraced Islam. I aspire to participate in jihad, but I found that Hajj and ‘Umrah have been prescribed for me. I asked one of my people about it, and he said to me: “Perform Hajj and ‘Umrah together and offer a sacrifice from what is easy for you,” and I performed them together.» ‘Umar then said: «You have been guided to the Sunnah of your Prophet, peace and blessings be upon him.» Abu Dawood 1799.
de: Was ‘Umrah betrifft, so wird ihre Verpflichtung durch die folgenden Hadithe belegt: 1 — Es wird berichtet, dass ‘Aischa, möge Allah mit ihr zufrieden sein, einmal fragte: «O Gesandter Allahs, sind Frauen verpflichtet, Dschihad zu leisten?» Der Gesandte Allahs, Allahs Segen und Frieden seien auf ihm, antwortete: «Ja, sie sind verpflichtet, einen Dschihad zu leisten, in dem es keinen Kampf gibt, und das ist Hajj und ‘Umrah.» Ahmad 6/165; Ibn Madschah 2901. Zu diesem Hadith sagte Ibn Khuzaymah, möge Allah sich seiner erbarmen: «Die Worte des Propheten, Allahs Segen und Frieden seien auf ihm: „...sie sind verpflichtet, einen Dschihad zu leisten, in dem es keinen Kampf gibt, und das ist Hajj und ‘Umrah“, verdeutlichen, dass ‘Umrah genauso verpflichtend ist wie Hajj.» Siehe «Sahih Ibn Khuzaymah», Hadith Nr. 3074. 2 — Es wird von ‘Umar, möge Allah mit ihm zufrieden sein, überliefert, dass der Gesandte Allahs, Allahs Segen und Frieden seien auf ihm, sagte: «Die Essenz des Islam besteht darin, dass du bezeugst, dass es keinen Gott gibt außer Allah und dass Muhammad der Gesandte Allahs ist, das Gebet verrichtest, die Zakat gibst, Hajj und ‘Umrah verrichtest, die große rituelle Reinigung nach einer Verunreinigung vollziehst sowie die kleine rituelle Reinigung ordnungsgemäß vollziehst und im Monat Ramadan fastest.» Siehe «Sahih Ibn Khuzaymah», Hadith Nr. 3065. Dieser Hadith findet sich auch bei Ad-Daraqutni 2/282. 3 — Es wird von Abu Razin Al-‘Uqayli berichtet, dass er einmal zum Propheten, Allahs Segen und Frieden seien auf ihm, kam und sagte: «O Gesandter Allahs, mein Vater ist sehr alt und kann weder Hajj noch ‘Umrah verrichten, noch kann er fest im Sattel sitzen.» Der Prophet, Allahs Segen und Frieden seien auf ihm, antwortete: «Verrichte Hajj und ‘Umrah für deinen Vater.» At-Tirmidhi 930. 4 — Es wird von As-Subay‘ ibn Ma‘bad berichtet, dass er einmal zu ‘Umar ibn Al-Khattab, möge Allah mit ihm zufrieden sein, sagte: «O Führer der Gläubigen, ich war ein Beduine und praktizierte das Christentum, dann nahm ich den Islam an. Ich strebe danach, Dschihad zu leisten, aber ich fand heraus, dass Hajj und ‘Umrah mir vorgeschrieben sind. Ich fragte eine Person aus meinem Volk darüber, und sie sagte zu mir: ‚Verrichte Hajj und ‘Umrah gemeinsam und opfere ein Tier von dem, was dir möglich ist‘, und so habe ich sie zusammen verrichtet.» Daraufhin sagte ‘Umar: «Du wurdest zur Sunnah deines Propheten, Allahs Segen und Frieden seien auf ihm, geleitet.» Abu Dawood 1799.
fr: Quant à l’obligation de la ‘Umrah, elle est établie par les hadiths suivants : 1 — Il est rapporté qu’‘Aïcha, qu’Allah soit satisfait d’elle, demanda un jour : «Ô Messager d’Allah, les femmes doivent-elles accomplir le djihad?» Le Messager d’Allah, qu’Allah le bénisse et lui accorde la paix, répondit : «Oui, elles doivent accomplir un djihad sans combat, qui est le Hajj et la ‘Umrah.» Ahmad 6/165 ; Ibn Madjah 2901. En commentant ce hadith, Ibn Khuzayma, qu’Allah lui fasse miséricorde, a dit : «Les paroles du Prophète, qu’Allah le bénisse et lui accorde la paix : “...elles doivent accomplir un djihad sans combat, qui est le Hajj et la ‘Umrah” montrent clairement que la ‘Umrah est aussi obligatoire que le Hajj.» Voir «Sahih Ibn Khuzayma», hadith n° 3074. 2 — Il est rapporté d’après ‘Oumar, qu’Allah soit satisfait de lui, que le Messager d’Allah, qu’Allah le bénisse et lui accorde la paix, a dit : «L’essence de l’Islam consiste à attester qu’il n’y a de dieu digne d’adoration qu’Allah, que Muhammad est le Messager d’Allah, à accomplir la prière, à donner la zakat, à accomplir le Hajj et la ‘Umrah, à effectuer la grande purification après une impureté majeure, à accomplir les ablutions mineures correctement et à jeûner pendant le mois de Ramadan.» Voir «Sahih Ibn Khuzayma», hadith n° 3065. Ce hadith est également rapporté par Ad-Daraqutni, 2/282. 3 — Il est rapporté d’après Abu Razin Al-‘Uqayli qu’il vint un jour voir le Prophète, qu’Allah le bénisse et lui accorde la paix, et lui dit : «Ô Messager d’Allah, mon père est très âgé et ne peut accomplir ni le Hajj ni la ‘Umrah, et ne peut même pas tenir sur une selle.» Le Prophète, qu’Allah le bénisse et lui accorde la paix, répondit : « Accomplis le Hajj et la ‘Umrah à la place de ton père. » At-Tirmidhi 930. 4 — Il est rapporté d’après As-Subay‘ ibn Ma‘bad qu’il dit un jour à ‘Oumar ibn Al-Khattab, qu’Allah soit satisfait de lui : «Ô Commandeur des croyants, j’étais bédouin et je pratiquais le christianisme, puis j’ai embrassé l’Islam. Je veux accomplir le djihad, mais j’ai découvert que le Hajj et la ‘Umrah me sont prescrits. J’ai interrogé une personne de mon peuple à ce sujet, et elle m’a dit : ‘Accomplis le Hajj et la ‘Umrah ensemble et offre un sacrifice selon ce qui t’est possible.’ Et je les ai accomplis ensemble. » Alors ‘Oumar lui répondit : «Tu as été guidé vers la Sunnah de ton Prophète, qu’Allah le bénisse et lui accorde la paix.» Abu Dawoud 1799.
id: Adapun tentang kewajiban umrah, berikut beberapa hadis yang menunjukkan hal tersebut: 1 — Diriwayatkan dari ‘Aisyah (semoga Allah meridhainya) bahwa ia pernah bertanya: “Wahai Rasulullah, apakah wanita juga wajib berjihad?” Beliau menjawab: «Ya, mereka diwajibkan jihad yang tidak ada peperangan di dalamnya, yaitu haji dan umrah.» (HR. Ahmad, 6/165; Ibnu Majah, 2901) Setelah menyebutkan hadis ini, Ibnu Khuzaimah (semoga Allah merahmatinya) berkata: “Ucapan Nabi shallallahu 'alaihi wa sallam: ‘…mereka diwajibkan jihad yang tidak ada peperangan di dalamnya, yaitu haji dan umrah,’ menunjukkan bahwa umrah adalah wajib seperti halnya haji.” (Shahih Ibnu Khuzaimah, no. 3074) 2 — Diriwayatkan dari Umar bin Khattab (semoga Allah meridhainya), bahwa Rasulullah shallallahu 'alaihi wa sallam bersabda: «Inti Islam adalah bersaksi bahwa tidak ada ilah selain Allah dan Muhammad adalah utusan-Nya, mendirikan shalat, menunaikan zakat, melaksanakan haji dan umrah, mandi janabah secara sempurna, berwudhu dengan sempurna, dan berpuasa di bulan Ramadan.» (Shahih Ibnu Khuzaimah, no. 3065; juga diriwayatkan oleh Ad-Daraquthni, 2/282) 3 — Diriwayatkan dari Abu Razin Al-‘Uqaili, bahwa ia pernah datang kepada Nabi shallallahu 'alaihi wa sallam dan berkata: “Wahai Rasulullah, ayahku sudah sangat tua, ia tidak mampu melaksanakan haji, umrah, dan bahkan tidak sanggup duduk di atas kendaraan.” Maka Nabi shallallahu 'alaihi wa sallam menjawab: «Lakukanlah haji dan umrah untuk ayahmu.» (HR. Tirmidzi, 930) 4 — Diriwayatkan dari As-Subai bin Ma‘bad, bahwa ia berkata kepada Umar bin Al-Khattab (semoga Allah meridhainya): “Wahai Amirul Mukminin, aku adalah orang Badui, dahulu beragama Nasrani, kemudian masuk Islam. Aku ingin berjihad, tetapi aku dapati bahwa haji dan umrah telah diwajibkan kepadaku. Lalu aku bertanya kepada seseorang dari kaumku, dan dia berkata: 'Laksanakan haji dan umrah sekaligus, dan sembelihlah hewan qurban yang mudah bagimu.' Maka aku pun melakukannya.” Umar berkata: “Kamu telah mendapat petunjuk kepada sunnah Nabimu shallallahu 'alaihi wa sallam.” (HR. Abu Daud, 1799)
ru: Что же касается ’умры, то на её обязательность указывают следующие хадисы: 1 — Сообщается, что ’Айша, да будет доволен ею Аллах, однажды, спросила: «О посланник Аллаха, должны ли женщины совершать джихад?» Посланник Аллаха, да благословит его Аллах и приветствует, ответил: «Да, они обязаны совершать джихад, в котором нет сражения, а это – хадж и ’умра». Ахмад, 6/165; ибн Маджах, 2901. Приведя этот хадис, ибн Хузейма, да смилуется над ним Аллах, сказал: «В словах пророка, да благословит его Аллах и приветствует: «…они обязаны совершать джихад, в котором нет сражения, а это – хадж и ’умра», разъяснение того, что ’умра так же обязательна, как и хадж». См. «Сахих ибн Хузеймы», хадис № 3074. 2 — Сообщается со слов ’Умара, да будет доволен им Аллах, что посланник Аллаха, да благословит его Аллах и приветствует, сказал: «Суть Ислама заключается в том, чтобы ты засвидетельствовал, что нет божества, достойного поклонения, кроме Аллаха, и что Мухаммад - посланник Аллаха, а также совершал намаз, давал закят, совершал хадж и ’умру, совершал полное омовение после полового осквернения, а также совершал малое омовение должным образом и постился в месяц Рамадан». См. «Сахих ибн Хузеймы», хадис № 3065. А также этот хадис у ад-Даракъутни, 2/282. 3 — Сообщается со слов Абу Разина аль-’Укъайли, что, однажды, он пришел к пророку, да благословит его Аллах и приветствует, и сказал: «О посланник Аллаха, поистине, мой отец очень стар и не может совершить ни хадж, ни ’умру, и даже не может сидеть в седле». Пророк, да благословит его Аллах и приветствует, ответил: «Соверши хадж и ’умру за своего отца». ат-Тирмизи, 930. 4 — Сообщается со слов ас-Субейи ибн Ма’бада, что, однажды, он сказал ’Умару ибн аль-Хаттабу, да будет доволен им Аллах: «О повелитель правоверных, поистине, я был бедуином и исповедовал христианство, а затем принял Ислам. Я стремлюсь попасть на джихад, но нашел то, что хадж и ’умра являются предписанными мне. Я спросил об этом у одного человека из моего народа, и он сказал мне: ″Соверши хадж и ’умру вместе и принеси в жертву животное из того, что тебе будет облегчено″, и я совершил их вместе». Тогда ’Умар сказал: «Ты был наставлен на сунну твоего пророка, да благословит его Аллах и приветствует». Абу Дауд, 1799.
tr: Umrenin farz olduğuna dair şu hadisler delil olarak getirilmiştir: 1 — Âişe’den (radıyallahu anha) rivayet edildiğine göre, bir gün Peygamberimiz’e (sallallahu aleyhi ve sellem) şöyle sordu: «Ey Allah’ın Resulü! Kadınlar da cihad etmeli mi?» Resulullah (sallallahu aleyhi ve sellem) şöyle buyurdu: «Evet, onlar savaş bulunmayan bir cihad yapmak zorundadır. Bu da hac ve umredir.» (Ahmed, 6/165; İbn Mâce, 2901). Bu hadisi zikreden İbn Huzeyme (rahimehullah) şöyle demiştir: «Resulullah’ın (sallallahu aleyhi ve sellem) 'Onlar savaşsız bir cihad yapmalıdır ve bu da hac ile umredir.' sözünde, umrenin de hac gibi farz olduğuna dair açıklık vardır.» (Sahih İbn Huzeyme, Hadis No: 3074). 2 — Ömer’den (radıyallahu anh) rivayet edildiğine göre, Resulullah (sallallahu aleyhi ve sellem) şöyle buyurmuştur: «İslam’ın temeli şudur: Allah’tan başka ilah olmadığına ve Muhammed’in O’nun resulü olduğuna şahitlik etmek, namaz kılmak, zekât vermek, hac ve umre yapmak, cünüplükten sonra gusletmek, abdest almak ve Ramazan ayında oruç tutmaktır.» (Sahih İbn Huzeyme, Hadis No: 3065; Darakutni, 2/282). 3 — Ebu Razin el-Uqayli’den rivayet edildiğine göre, bir gün Resulullah’a (sallallahu aleyhi ve sellem) gelerek şöyle dedi: «Ey Allah’ın Resulü! Babam çok yaşlıdır, ne hac ne de umre yapabilir, hatta hayvana bile binemez.» Resulullah (sallallahu aleyhi ve sellem) şöyle buyurdu: «Babanın yerine hac ve umre yap.» (Tirmizî, 930). 4 — Es-Subey’î ibn Ma’bad’dan rivayet edildiğine göre, Ömer ibn Hattab’a (radıyallahu anh) şöyle dedi: «Ey müminlerin emiri! Ben önceden bedevi bir Hristiyandım, sonra İslam’a girdim ve cihada gitmek istedim. Ancak hac ve umrenin bana farz kılındığını öğrendim. Kavmimden birine sordum ve bana, 'Hac ve umreyi birlikte yap ve gücünün yettiği bir kurban kes' dedi. Ben de hac ve umreyi birlikte yaptım.» Bunun üzerine Ömer (radıyallahu anh) şöyle dedi: «Sen, Resulullah’ın (sallallahu aleyhi ve sellem) sünnetine uygun davrandın.» (Ebu Davud, 1799).

# hajj_umrah_obligation_concluding_evidence
source: Hajj and ‘Umrah are obligatory for those who meet the conditions for their performance. Muslims are unanimous on the obligation of Hajj when all the conditions are fulfilled. It is important to note that Hajj and ‘Umrah undertaken after a vow or voluntarily begun must be completed.
de: Hajj und ‘Umrah sind für diejenigen verpflichtend, die die Voraussetzungen für ihre Durchführung erfüllen. Die Muslime sind sich einig über die Verpflichtung des Hajj, wenn alle Bedingungen erfüllt sind. Es ist wichtig zu beachten, dass Hajj und ‘Umrah, die nach einem Gelübde verrichtet oder begonnen wurden, abgeschlossen werden müssen.
fr: Le Hajj et la ‘Umrah sont obligatoires pour ceux qui remplissent les conditions nécessaires à leur accomplissement. Les musulmans sont unanimes sur l’obligation du Hajj lorsque toutes les conditions sont réunies. Il est important de noter que le Hajj et la ‘Umrah, accomplis après un vœu ou commencés, doivent être achevés.
id: Haji dan umrah adalah wajib bagi siapa saja yang telah memenuhi syarat-syaratnya. Kaum muslimin sepakat atas kewajiban haji dalam kondisi tersebut. Perlu diingat, haji atau umrah yang dinadzarkan atau yang telah dimulai harus disempurnakan.
ru: Хадж и ’умра обязательны для того, кто имеет условия для их совершения. Мусульмане единогласны в обязательности хаджа, когда выполняются все условия. Важно отметить, что хадж и умра, которые совершаются после обета или начаты, должны быть завершены.
tr: Hac ve umre, şartları taşıyan her Müslüman için farzdır. Haccın farz olduğu konusunda Müslümanlar icma etmişlerdir. Ayrıca, yapılan bir adaktan dolayı hac ve umre farz hale gelebilir ve başlanılan nafile bir hac veya umre tamamlanmalıdır.

# title_ihram_screen
source: Ihram
ar: الإحرام
fr: État de Ihram
ru: Ихрам

# Allah is great.
source: Allahu Akbar.
ru: Аллаhу Акбар.
