Repository: Saydulayev/umra
Catalog: umra/*.lproj/Localizable.strings
Languages: ar, de, fr, id, ru, tr

# settings_string
source: Settings
ar: الإعدادات
de: Einstellungen
fr: Paramètres
id: Pengaturan
ru: Настройки
tr: Ayarlar

# add_string
source: Add
ar: إضافة
de: Hinzufügen
fr: Ajouter
id: Tambah
ru: Добавить
tr: Ekle

# reset_string
source: Reset
ar: إعادة تعيين
de: Zurücksetzen
fr: Réinitialiser
id: Atur Ulang
ru: Сбросить
tr: Sıfırla

# Sa´y finished_string
source: Sa´y finished
ar: انتهى السعي
de: Sa´y ist fertig
fr: Sa´y terminé
id: Sa'i selesai
ru: Cа´й закончено
tr: Sa´y tamamlandı

# circle_string
source: Walkthrough:
ar: السعي:
de: Komplettlösung:
fr: Tour:
id: Putaran:
ru: Прохождение:
tr: Tur:

source: Background color
ar: لون الخلفية
de: Hintergrundfarbe
fr: Couleur de fond
id: Warna latar belakang
ru: Цвет фона
tr: Arka plan rengi

source: Text color
ar: لون النص
de: Textfarbe
fr: Couleur du texte
id: Warna teks
ru: Цвет текста
tr: Metin rengi

source: Size
ar: الحجم
de: Größe
fr: Taille
id: Ukuran
ru: Размер
tr: Boyut

source: Font
ar: الخط
de: Schriftart
fr: Police
id: Jenis huruf
ru: Шрифт
tr: Yazı tipi

# _donate_button
source: Donate
ar: تبرع
de: Spenden
fr: Faire un don
id: Donasi
ru: Пожертвовать
tr: Bağış Yap

source: Select the amount:
ar: اختر المبلغ:
de: Wählen Sie den Betrag:
fr: Choisissez le montant:
id: Pilih jumlah:
ru: Выберите сумму:
tr: Miktarı seçin:

# Contribution to Application Development
source: Your donation is entirely voluntary. It does not entail receiving any additional digital content or special features in the application. Our aim is to provide an application that is free and accessible to everyone, without any exceptions.
ar: تبرعك هو عمل تطوعي بحت. لا يرتبط بأي محتوى رقمي إضافي أو ميزات خاصة داخل التطبيق. هدفنا هو تقديم تطبيق مجاني ومتاح للجميع بدون أي قيود.
de: Wir haben diese App kostenlos gemacht, damit sie allen nützt. Wenn Sie den Wunsch verspüren, können Sie etwas beitragen und Teil dieses Guten werden. Ihre Spende ist vollkommen freiwillig, einmalig und steht in keinem Zusammenhang mit einem Abonnement oder zusätzlichen Funktionen.
fr: Nous avons créé cette application gratuitement afin qu’elle profite à tous. Si vous en avez le désir, vous pouvez contribuer et faire partie de ce bien. Votre don est entièrement volontaire, unique, et n’est lié à aucun abonnement ni à des fonctionnalités supplémentaires.
id: Kami membuat aplikasi ini gratis agar bisa bermanfaat untuk semua orang. Jika ada keinginan di hati, Anda dapat berkontribusi dan menjadi bagian dari kebaikan ini. Donasi Anda sepenuhnya sukarela, sekali saja, dan tidak terkait dengan langganan atau fitur tambahan apa pun.
ru: Мы сделали это приложение бесплатным, чтобы оно приносило пользу всем. Если у вас будет желание, вы можете внести свой вклад и стать частью этого добра. Ваше пожертвование — полностью добровольное, одноразовое и не связано с подпиской или дополнительными функциями.
tr: Bu uygulamayı herkes faydalansın diye ücretsiz yaptık. Eğer içinizde bir istek olursa, katkıda bulunabilir ve bu hayrın bir parçası olabilirsiniz. Bağışınız tamamen gönüllüdür, tek seferliktir ve herhangi bir abonelikle veya ek özelliklerle bağlantılı değildir.

# Useful
source: Helpful
ar: مفيد
de: Hilfreich
fr: Utile
id: Berguna
ru: Полезное
tr: Faydalı

# soon_available_text
source: This text has been translated from Russian using AI. If you notice any errors or inaccuracies, please let us know through feedback.
ar: سيكون هذا النص متاحًا قريبًا بلغات أخرى.
de: Dieser Text wurde mit KI aus dem Russischen übersetzt. Wenn Sie Fehler oder Ungenauigkeiten bemerken, lassen Sie es uns bitte über das Feedback wissen.
fr: Ce texte a été traduit du russe à l'aide de l'IA. Si vous remarquez des erreurs ou des inexactitudes, veuillez nous en informer via les retours.
id: Teks ini diterjemahkan dari bahasa Rusia ke bahasa lain menggunakan AI. Jika Anda menemukan kesalahan terjemahan, mohon beri tahu kami melalui fitur masukan.
ru: Этот текст был переведен с русского языка на другие языки с использованием ИИ. Если вы заметите ошибку в переводе, пожалуйста, сообщите нам через обратную связь.
tr: Bu metin yapay zeka kullanılarak Rusçadan diğer dillere çevrildi. Çeviride bir hata fark ederseniz, lütfen geri bildirim yoluyla bize bildirin.

source: Notification Settings
ar: إعدادات الإشعارات
de: Benachrichtigungseinstellungen
fr: Paramètres des notifications
id: Pengaturan Notifikasi
ru: Настройки уведомлений
tr: Bildirim Ayarları

# 30-Minute Notifications
source: Notify 30 minutes before prayer
ar: إشعارات قبل 30 دقيقة
de: 30 Minuten vorher benachrichtigen
fr: Notifier 30 minutes avant la prière
id: Notifikasi 30 menit sebelum waktu shalat
ru: Уведомлять за 30 минут до молитвы
tr: Namazdan 30 dakika önce bildirim gönder

# Prayer Time Notifications
source: Notify at prayer time
ar: إشعارات وقت الصلاة
de: Benachrichtigen zur Gebetszeit
fr: Notifier à l'heure de la prière
id: Notifikasi saat masuk waktu shalat
ru: Уведомлять во время молитвы
tr: Namaz vakti bildirimi gönder

# Sunrise Notifications
source: Notify at sunrise
de: Benachrichtigen bei Sonnenaufgang
fr: Notifier au lever du soleil
id: Notifikasi waktu matahari terbit
ru: Уведомлять о восходе солнца
tr: Güneş doğuşu bildirimi gönder

source: Open iOS Notification Settings
de: iOS-Benachrichtigungseinstellungen öffnen
fr: Ouvrir les paramètres de notifications iOS
id: Buka pengaturan notifikasi iOS
ru: Открыть настройки уведомлений iOS
tr: iOS Bildirim Ayarlarını Aç

source: Close
ar: إغلاق
de: Schließen
fr: Fermer
id: Tutup
ru: Закрыть
tr: Kapat

# useful_info_title
source: Useful Information
ar: معلومات مفيدة
de: Nützliche Informationen
fr: Informations utiles
id: Informasi Bermanfaat
ru: Полезная информация
tr: Faydalı Bilgiler

# etiquette_manners
source: Etiquette and Manners
ar: الآداب والأخلاق
de: Etikette und Manieren
fr: Étiquette et bonnes manières
id: Etika dan Akhlak
ru: Этикет и нравы
tr: Adap ve Ahlak

source: Sincerity
ar: الإخلاص
de: Aufrichtigkeit
fr: Sincérité
id: Ketulusan Niat
ru: Искренность
tr: İhlâs

# laws
source: Legislations
ar: الأحكام الشرعية
de: Rechtsvorschriften
fr: Réglementations
id: Hukum-Hukum
ru: Законоположения
tr: Hükümler

# choice_of_companions
source: Choosing Companions
ar: اختيار الرفاق
de: Wahl der Gefährten
fr: Choix des compagnons
id: Memilih Teman Perjalanan
ru: Выбор спутников
tr: Yol Arkadaşı Seçimi

source: Financial Independence
ar: الاستقلال المالي
de: Finanzielle Unabhängigkeit
fr: Indépendance financière
id: Kemandirian Finansial
ru: Финансовая независимость
tr: Mali Bağımsızlık

source: Noble Manners
ar: الأخلاق النبيلة
de: Edle Manieren
fr: Bonnes mœurs
id: Akhlak Mulia
ru: Благородные нравы
tr: Asil Ahlak

# zikr_and_prayers
source: Remembrance and Supplications
ar: الذكر والدعاء
de: Gedenken und Gebete
fr: Dhikr et prières
id: Zikir dan Doa
ru: Зикр и мольбы
tr: Zikir ve Dualar

source: Caution in Relationships
ar: الحذر في العلاقات
de: Vorsicht in Beziehungen
fr: Prudence dans les relations
id: Kewaspadaan dalam Hubungan
ru: Осторожность в отношениях
tr: İlişkilerde Dikkat

# hajj_umrah_virtues
source: Virtues of Hajj and Umrah
ar: فضائل الحج والعمرة
de: Die Vorzüge von Hajj und Umrah
fr: Les vertus du Hajj et de la 'Umrah
id: Keutamaan Haji dan Umrah
ru: Достоинство хаджа и умры
tr: Hac ve Umrenin Faziletleri

# atonement_and_rewards
source: Expiation of Sins and Reward
ar: تكفير الذنوب والثواب
de: Sündenvergebung und Belohnung
fr: Expiation des péchés et récompenses
id: Pengampunan Dosa dan Pahala
ru: Искупление грехов и награда
tr: Günahların Kefareti ve Sevap

source: Hajj for Women
ar: الحج للنساء
de: Hajj für Frauen
fr: Hajj pour les femmes
id: Haji untuk Wanita
ru: Хадж для женщин
tr: Kadınlar İçin Hac

source: Perfect Hajj
ar: حج مثالي
de: Perfekter Hajj
fr: Hajj parfait
id: Haji yang Sempurna
ru: Безупречный хадж
tr: Kusursuz Hac

source: Following the Sunnah
ar: اتباع السنة
de: Das Befolgen der Sunnah
fr: Suivre la Sunnah
id: Mengikuti Sunnah
ru: Следование сунне
tr: Sünnete Uymak

# hajj_umrah_obligation
source: Obligation of Hajj and Umrah
ar: وجوب الحج والعمرة
de: Die Verpflichtung von Hajj und Umrah
fr: Obligation du Hajj et de la 'Umrah
id: Kewajiban Haji dan Umrah
ru: Обязательность хаджа и умры
tr: Hac ve Umrenin Farziyeti

# hajj_obligation_evidence
source: Evidence of Hajj Obligation
ar: أدلة وجوب الحج
de: Beweise für die Verpflichtung des Hajj
fr: Preuves de l'obligation du Hajj
id: Dalil Kewajiban Haji
ru: Доказательства обязательности хаджа
tr: Haccın Farz Olduğuna Dair Deliller

# umrah_obligation_evidence
source: Evidence of Umrah Obligation
ar: أدلة وجوب العمرة
de: Beweise für die Verpflichtung der Umrah
fr: Preuves de l'obligation de la 'Umrah
id: Dalil Kewajiban Umrah
ru: Доказательства обязательности умры
tr: Umrenin Farz Olduğuna Dair Deliller

source: Conclusion
ar: الخاتمة
de: Schlussfolgerung
id: Kesimpulan
ru: Заключение
tr: Sonuç

# etiquette_manners_text1
source: The most important duty for a person performing Hajj and ‘Umrah is sincerity before Allah. One must rid themselves of ostentation and the desire for fame in order to receive the reward for this Hajj and ‘Umrah. It is reported from Abu Hurayrah, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, said: 'Allah, the Most High, said: «I am entirely independent of needing any partner. Whoever performs any deed for My sake but also for someone else, I will leave him and his act of associating partners with Me!»' Muslim, 2985. It is also reported that the Messenger of Allah, peace and blessings be upon him, said: 'O Allah, make this Hajj one free of ostentation and the desire for fame!' Ibn Majah, 2890.
de: Das Wichtigste für jemanden, der Hajj und ‘Umrah verrichtet, ist die Aufrichtigkeit gegenüber Allah. Er muss sich von Heuchelei und dem Verlangen nach Ruhm befreien, um die Belohnung für diesen Hajj und diese ‘Umrah zu erhalten. Es wird von Abu Huraira, möge Allah mit ihm zufrieden sein, überliefert, dass der Gesandte Allahs, Allahs Segen und Frieden seien auf ihm, sagte: «Allah, der Erhabene, sprach: „Ich bin völlig unabhängig davon, dass Mir Teilhaber zur Seite gestellt werden. Wer etwas tut, nicht nur für Mich, sondern auch für jemand anderen, den werde Ich verlassen, ebenso wie sein Beigesellen!“» Muslim, 2985. Es wird auch berichtet, dass der Gesandte Allahs, Allahs Segen und Frieden seien auf ihm, sagte: «O Allah, mache diesen Hajj frei von Heuchelei und dem Verlangen nach Ruhm!» Ibn Madschah, 2890.
fr: La chose la plus importante pour une personne accomplissant le Hajj et la ‘Umrah est la sincérité envers Allah. Elle doit se débarrasser de toute ostentation et de tout désir de gloire afin de recevoir la récompense pour ce Hajj et cette ‘Umrah. Il est rapporté d’après Abu Hurayra, qu’Allah soit satisfait de lui, que le Messager d’Allah, qu’Allah le bénisse et lui accorde la paix, a dit : «Allah le Très-Haut a dit : «Je n’ai absolument pas besoin qu’on Me donne des associés. Si quelqu’un fait une action non seulement pour Moi, mais aussi pour quelqu’un d’autre, Je le rejetterai, ainsi que son associationnisme!»» Muslim, 2985. Il est également rapporté que le Messager d’Allah, qu’Allah le bénisse et lui accorde la paix, a dit : « Ô Allah, rends ce Hajj exempt d’ostentation et de désir de gloire ! » Ibn Majah, 2890.
id: Hal terpenting yang wajib dimiliki oleh seseorang yang melaksanakan haji dan umrah adalah keikhlasan kepada Allah. Ia harus membersihkan niatnya dari riya dan keinginan untuk terkenal, agar amal haji dan umrahnya diterima dan diberi ganjaran oleh Allah. Diriwayatkan dari Abu Hurairah (semoga Allah meridhainya), Rasulullah (shallallahu 'alaihi wa sallam) bersabda: «Allah Yang Mahatinggi berfirman: 'Aku adalah Dzat yang paling tidak membutuhkan sekutu. Barang siapa melakukan suatu amal dengan menyekutukan-Ku dengan selain-Ku, maka Aku tinggalkan dia dan kesyirikannya.'» (HR. Muslim, 2985) Juga diriwayatkan bahwa Rasulullah (shallallahu 'alaihi wa sallam) bersabda: «Ya Allah, jadikanlah haji ini tanpa riya dan tanpa keinginan untuk dikenal.» (HR. Ibnu Majah, 2890)
ru: Самым важным из того, чем обязан человек, совершающий хадж и ’умру, является искренность перед Аллахом. Он должен избавиться от показухи и желания славы, дабы получить вознаграждение за этот хадж и эту ’умру. Сообщается со слов Абу Хурейры, да будет доволен им Аллах, что посланник Аллаха, да благословит его Аллах и приветствует, сказал: «Аллах Всевышний сказал: "Я совершенно не нуждаюсь в том, чтобы Мне придавали сотоварищей, если же кто-то совершит что-либо не только ради Меня, но и ради кого-то другого, Я откажусь и от него, и от его многобожия!"». Муслим, 2985. Также сообщается, что посланник Аллаха, да благословит его Аллах и приветствует, сказал: «О Аллах, (сделай этот) хадж таким, в котором нет ни показухи, ни желания славы!» ибн Маджах, 2890.
tr: Hac ve umre yapan kişinin en önemli vazifesi, Allah'a karşı ihlaslı olmaktır. O, riyadan ve şöhret arzusundan arınmalı, böylece bu hac ve umre ibadetinin mükafatını almalıdır. Ebu Hureyre'den (radıyallahu anh) rivayet edildiğine göre, Resulullah (sallallahu aleyhi ve sellem) şöyle buyurdu: «Allah Teâlâ buyurdu ki: 'Ben, ortak koşulmasından en fazla müstağni olanım. Kim bir amel işler ve onda Beni başkasıyla ortak kılarsa, onu da, o şirkini de reddederim!'». (Müslim, 2985) Ayrıca, Resulullah (sallallahu aleyhi ve sellem) şöyle dua etmiştir: «Allah’ım! Riyadan ve gösterişten uzak bir hac nasip eyle!» (İbn Mâce, 2890).

# etiquette_manners_text2
source: A person intending to perform Hajj and ‘Umrah must strive to learn the rulings related to Hajj and ‘Umrah so that they perform them based on knowledge.
de: Eine Person, die Hajj und ‘Umrah verrichten möchte, sollte sich bemühen, die Vorschriften im Zusammenhang mit Hajj und ‘Umrah zu lernen, um sie auf der Grundlage von Wissen zu vollziehen.
fr: Une personne souhaitant accomplir le Hajj et la ‘Umrah doit s’efforcer d’étudier les dispositions relatives au Hajj et à la ‘Umrah afin de les accomplir en connaissance de cause.
id: Orang yang berniat melaksanakan haji dan umrah hendaknya bersungguh-sungguh dalam mempelajari hukum-hukum syar'i yang berkaitan dengan keduanya agar ia dapat melakukannya dengan ilmu dan pemahaman.
ru: Человек, желающий совершить хадж и ’умру, должен проявить усердие в изучении законоположений, связанных с хаджем и ’умрой, чтобы совершить их на основе знания.
tr: Hac ve umre yapmak isteyen kişi, bu ibadetleri ilme dayalı bir şekilde yerine getirebilmek için hac ve umreyle ilgili fıkhî hükümleri öğrenmeye gayret etmelidir.

# etiquette_manners_text3
source: A person performing Hajj and ‘Umrah should strive to choose the best companions for their journey during Hajj, so they may benefit from them in both knowledge and character. It is reported from Abu Musa al-Ash‘ari, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, said: «The example of a righteous companion and a bad one is like that of a seller of musk and a blacksmith’s bellows. As for the seller of musk, he will either gift it to you, or you will buy something from him, or you will enjoy a pleasant fragrance from him. As for the blacksmith’s bellows, it will either burn your clothes, or you will experience an unpleasant odor from it.» Al-Bukhari 5534, Muslim 2628.
de: Eine Person, die Hajj und ‘Umrah verrichtet, sollte versuchen, die besten Gefährten für die Reise zum Hajj auszuwählen, um von ihnen sowohl im Wissen als auch im Verhalten zu profitieren. Es wird von Abu Musa al-Asch‘ari, möge Allah mit ihm zufrieden sein, überliefert, dass der Gesandte Allahs, Allahs Segen und Frieden seien auf ihm, sagte: «Das Beispiel eines rechtschaffenen Gefährten und eines schlechten ist wie das eines Verkäufers von Moschus und eines Schmiedes, der den Blasebalg betätigt. Was den Moschusverkäufer betrifft, so wird er dir entweder ein Geschenk machen, du wirst etwas von ihm kaufen oder du wirst seinen angenehmen Duft genießen. Was jedoch den Schmied betrifft, so wird er entweder deine Kleidung verbrennen oder du wirst seinen üblen Geruch wahrnehmen.» Al-Bukhari 5534, Muslim 2628.
fr: Une personne accomplissant le Hajj et la ‘Umrah doit s’efforcer de choisir les meilleurs compagnons de voyage pour le Hajj, afin de tirer profit de leur savoir et de leur comportement. Il est rapporté d’après Abu Musa al-Ash‘ari, qu’Allah soit satisfait de lui, que le Messager d’Allah, qu’Allah le bénisse et lui accorde la paix, a dit : «L’exemple d’un bon compagnon et d’un mauvais est semblable à celui d’un vendeur de musc et d’un forgeron utilisant un soufflet. Quant au vendeur de musc, soit il t’en fait cadeau, soit tu lui en achètes, soit tu profites de son agréable parfum. Quant au forgeron utilisant un soufflet, soit il brûle tes vêtements, soit tu es incommodé par son odeur désagréable.» Al-Boukhari 5534, Mouslim 2628.
id: Seseorang yang menunaikan haji dan umrah hendaknya memilih teman perjalanan yang terbaik, agar dapat mengambil manfaat dari ilmu dan akhlaknya. Diriwayatkan dari Abu Musa Al-Asy'ari (semoga Allah meridhainya), Rasulullah (shallallahu 'alaihi wa sallam) bersabda: «Perumpamaan teman yang baik dan teman yang buruk adalah seperti penjual minyak wangi dan pandai besi. Penjual minyak wangi, bisa jadi akan memberimu, atau kamu membelinya darinya, atau kamu mendapatkan aroma harum darinya. Sedangkan pandai besi, bisa jadi ia akan membakar pakaianmu atau kamu mencium bau tak sedap darinya.» (HR. Bukhari, 5534; Muslim, 2628)
ru: Человек, совершающий хадж и ’умру, должен постараться выбрать самых лучших спутников на время пути в хадж, дабы взять от них пользу, как в знании, так и в поведении. Сообщается со слов Абу Мусы аль-Аш’ари, да будет доволен им Аллах, что посланник Аллаха, да благословит его Аллах и приветствует, сказал: «Пример праведного спутника и плохого, подобно продавцу мускуса и раздувающему кузнечный мех. Что касается продавца мускуса, то либо он сделает тебе подарок, либо ты купишь у него что-нибудь, либо ощутишь исходящий от него аромат. Что же касается раздувающего мех, то либо он прожжет твою одежду, либо ты ощутишь исходящее от него зловоние». аль-Бухари 5534, Муслим 2628.
tr: Hac ve umre yapan kişi, yolculuk esnasında kendisine en hayırlı arkadaşları seçmeye özen göstermelidir. Böylece onlardan hem ilim hem de ahlak açısından fayda görebilir. Ebu Musa el-Eş'arî'den (radıyallahu anh) rivayet edildiğine göre, Resulullah (sallallahu aleyhi ve sellem) şöyle buyurdu: «Salih dost ile kötü dostun misali, misk satıcısı ile körük üfleyen demirciye benzer. Misk satıcısı ya sana hediye verir, ya sen ondan misk satın alırsın ya da en azından güzel kokusunu duyarsın. Körük üfleyen demirci ise ya elbiseni yakar ya da ondan gelen kötü kokuyu duyarsın.» (Buhari, 5534; Müslim, 2628).

# etiquette_manners_text4
source: A person performing Hajj and ‘Umrah should have sufficient funds with them so that they do not depend on others for financial assistance. It is reported from Abu Sa‘id al-Khudri, may Allah be pleased with him, that the Prophet, peace and blessings be upon him, said: «Whoever strives for self-restraint, Allah will grant them self-restraint, and whoever seeks self-sufficiency, Allah will make them self-sufficient.» Al-Bukhari 1469, Muslim 1053.
de: Eine Person, die Hajj und ‘Umrah verrichtet, sollte über eine ausreichende Menge Geld verfügen, damit sie nicht auf das Geld anderer Menschen angewiesen ist. Es wird von Abu Sa‘id al-Khudri, möge Allah mit ihm zufrieden sein, überliefert, dass der Prophet, Allahs Segen und Frieden seien auf ihm, sagte: «Wer danach strebt, Enthaltsamkeit zu bewahren, den wird Allah zur Enthaltsamkeit führen, und wer danach strebt, unabhängig zu sein, den wird Allah unabhängig machen.» Al-Bukhari 1469, Muslim 1053.
fr: Une personne accomplissant le Hajj et la ‘Umrah doit avoir avec elle une somme d’argent suffisante pour ne pas dépendre financièrement des autres. Il est rapporté d’après Abu Sa‘id al-Khudri, qu’Allah soit satisfait de lui, que le Prophète, qu’Allah le bénisse et lui accorde la paix, a dit : «Celui qui cherche à être modeste, Allah le rendra modeste, et celui qui s’efforce d’être autonome, Allah le rendra indépendant des autres.» Al-Boukhari 1469, Mouslim 1053.
id: Orang yang berhaji dan berumrah hendaknya membawa bekal yang cukup agar tidak bergantung pada orang lain secara finansial. Diriwayatkan dari Abu Sa’id Al-Khudri (semoga Allah meridhainya), Nabi (shallallahu 'alaihi wa sallam) bersabda: «Barang siapa berusaha untuk menjaga kehormatan dirinya (tidak meminta-minta), Allah akan memberinya kemampuan menjaga diri. Dan barang siapa berusaha mencukupi dirinya, Allah akan mencukupinya.» (HR. Bukhari, 1469; Muslim, 1053)
ru: Человек, совершающий хадж и ’умру, должен иметь при себе определенное количество денег, чтобы не нуждаться в деньгах других людей. Сообщается со слов Абу Са’ида аль-Худри, да будет доволен им Аллах, что пророк, да благословит его Аллах и приветствует, сказал: «Того, кто станет стремиться к воздержанности, Аллах приведёт к воздержанности, того, кто станет пытаться обходиться своими силами, Аллах избавит от необходимости обращаться к другим». аль-Бухари, 1469; Муслим, 1053.
tr: Hac ve umre yapan kişi, başkalarına muhtaç olmamak için yeterli maddi imkana sahip olmalıdır. Ebu Said el-Hudrî'den (radıyallahu anh) rivayet edildiğine göre, Peygamberimiz (sallallahu aleyhi ve sellem) şöyle buyurmuştur: «Kim iffetli olmaya çalışırsa, Allah ona iffet ihsan eder; kim başkasına muhtaç olmamaya çalışırsa, Allah onu başkasına muhtaç olmaktan kurtarır.» (Buhari, 1469; Müslim, 1053).
