Repository: Saydulayev/umra
Catalog: umra/*.lproj/Localizable.strings
Languages: ar, de, fr, id, ru, tr

# hajj_umrah_obligation_obligation_evidence
source: Performing Hajj and ‘Umrah is obligatory once in a lifetime, and whoever performs them more than once, it is considered voluntary worship. Hajj and ‘Umrah also become obligatory if one makes a vow (nazr). If a person vows to Allah to perform Hajj or ‘Umrah, they must fulfill their vow. If a person begins performing a voluntary Hajj or ‘Umrah, they are required to complete it, as Allah said: «Complete the Hajj and ‘Umrah for Allah.» (Surah Al-Baqarah, Ayah 196) The obligation of performing Hajj is established by evidence from the Qur’an, the Sunnah, and the consensus (ijma‘) of Muslims. Allah the Exalted said: «Pilgrimage to the House (Ka‘bah) is a duty owed to Allah by people who are able to undertake it. And if anyone refuses to obey, then indeed Allah has no need of the worlds.» (Surah Aal ‘Imran, Ayah 97) The Prophet, peace and blessings be upon him, said: «Islam is built upon five (pillars): the testimony that there is no deity worthy of worship except Allah and that Muhammad is the Messenger of Allah, establishing prayer, paying zakat, performing Hajj, and fasting during Ramadan.» Al-Bukhari 8, Muslim 16. He also said: «Islam is to bear witness that there is no deity worthy of worship except Allah and that Muhammad is the Messenger of Allah, to establish prayer, to give zakat, to fast during Ramadan, and to perform Hajj to the House if you are able to do so.» Muslim 8. It is also reported that Abu Hurayrah, may Allah be pleased with him, said: «The Messenger of Allah, peace and blessings be upon him, once addressed us and said: «O people, Hajj has been made obligatory upon you, so perform it.» A man asked, «Every year, O Messenger of Allah?» The Prophet, peace and blessings be upon him, remained silent until the man repeated the question three times. Then the Messenger of Allah, peace and blessings be upon him, said: «If I were to say ‘Yes,’ it would become obligatory upon you, but you would not be able to do it.» Muslim 1337. The Muslim community unanimously agrees that Hajj is obligatory for anyone who meets all the conditions for its obligation.
de: Das Verrichten von Hajj und ‘Umrah ist einmal im Leben verpflichtend, und wer sie mehr als einmal verrichtet, erfüllt freiwillige Anbetung. Hajj und ‘Umrah können auch verpflichtend werden, wenn ein Gelübde (Nadhr) abgelegt wurde. Wenn eine Person Allah ein Gelübde gibt, Hajj oder ‘Umrah zu verrichten, muss sie dieses Gelübde erfüllen. Wenn jemand mit einem freiwilligen Hajj oder ‘Umrah begonnen hat, ist er verpflichtet, sie zu Ende zu führen, denn Allah sagt: «Vollzieht den Hajj und die ‘Umrah für Allah.» (Sure Al-Baqara, Vers 196) Die Verpflichtung, Hajj zu verrichten, basiert auf Beweisen aus dem Qur’an und der Sunnah sowie auf dem Konsens (Idschma‘) der Muslime. Allah, der Erhabene, sagt: «Die Menschen sind Allah gegenüber verpflichtet, die Pilgerfahrt zum Haus (Kaaba) zu unternehmen, wenn sie dazu in der Lage sind. Wer jedoch ablehnt, so ist Allah der Welten nicht bedürftig.» (Sure Aal ‘Imran, Vers 97) Der Prophet, Allahs Segen und Frieden seien auf ihm, sagte: «Der Islam basiert auf fünf (Säulen): dem Zeugnis, dass es keinen Gott gibt außer Allah und dass Muhammad der Gesandte Allahs ist, dem Verrichten des Gebets, der Entrichtung der Zakat, der Verrichtung des Hajj und dem Fasten im Ramadan.» Al-Bukhari 8, Muslim 16. Er sagte auch: «(Die Essenz) des Islam ist, dass du bezeugst, dass es keinen Gott gibt außer Allah und dass Muhammad der Gesandte Allahs ist, das Gebet verrichtest, die Zakat entrichtest, im Ramadan fastest und die Pilgerfahrt zum Haus unternimmst, wenn du dazu in der Lage bist.» Muslim 8. Es wird auch berichtet, dass Abu Huraira, möge Allah mit ihm zufrieden sein, sagte: «Eines Tages hielt der Gesandte Allahs, Allahs Segen und Frieden seien auf ihm, uns eine Ansprache und sagte: „O Menschen, der Hajj ist euch zur Pflicht gemacht worden, so verrichtet ihn.“ Ein Mann fragte: „Jedes Jahr, o Gesandter Allahs?“ – aber der Prophet, Allahs Segen und Frieden seien auf ihm, schwieg, bis der Mann seine Frage dreimal wiederholte. Da sagte der Gesandte Allahs, Allahs Segen und Frieden seien auf ihm: „Wenn ich ‚Ja‘ sage, würde es für euch zur Pflicht, aber ihr könntet es nicht erfüllen.“» Muslim 1337. Die Muslime sind sich einig, dass der Hajj für diejenigen verpflichtend ist, die alle Bedingungen für die Verpflichtung des Hajj erfüllen.
fr: L’accomplissement du Hajj et de la ‘Umrah est obligatoire une fois dans une vie. Celui qui les accomplit plus d’une fois réalise un acte d’adoration volontaire. Le Hajj et la ‘Umrah peuvent également devenir obligatoires après un vœu (nadhr). Si une personne fait le vœu devant Allah d’accomplir le Hajj ou la ‘Umrah, elle doit obligatoirement s’acquitter de ce vœu. Si une personne commence un Hajj ou une ‘Umrah volontaire, elle est tenue de les terminer, car Allah a dit : «Achevez le Hajj et la ‘Umrah pour Allah.» (Sourate Al-Baqara, verset 196) L’obligation d’accomplir le Hajj est établie par des preuves tirées du Coran, de la Sunna, ainsi que par le consensus (ijma‘) des musulmans. Allah le Très-Haut a dit : «Les gens ont un devoir envers Allah : accomplir le pèlerinage à la Maison, s’ils en ont les moyens. Et quiconque refuse de croire, Allah Se passe largement des mondes.» (Sourate Aal ‘Imran, verset 97) Le Prophète, qu’Allah le bénisse et lui accorde la paix, a dit : «L’Islam repose sur cinq piliers : attester qu’il n’y a de dieu digne d’adoration qu’Allah et que Muhammad est le Messager d’Allah, accomplir la prière, s’acquitter de la zakat, accomplir le Hajj et jeûner le mois de Ramadan.» Al-Boukhari 8, Mouslim 16. Il a également dit : «(L’essence de) l’Islam consiste à attester qu’il n’y a de dieu digne d’adoration qu’Allah et que Muhammad est le Messager d’Allah, à accomplir la prière, à donner la zakat, à jeûner pendant le Ramadan et à accomplir le Hajj à la Maison si tu en es capable.» Mouslim 8. Il est également rapporté qu’Abu Hurayra, qu’Allah soit satisfait de lui, a dit : «Un jour, le Messager d’Allah, qu’Allah le bénisse et lui accorde la paix, nous fit un sermon et dit : “Ô gens, le Hajj vous a été rendu obligatoire, accomplissez-le donc.” Un homme demanda : “Chaque année, ô Messager d’Allah ?” Le Prophète, qu’Allah le bénisse et lui accorde la paix, resta silencieux jusqu’à ce que l’homme répète sa question trois fois. Alors le Messager d’Allah, qu’Allah le bénisse et lui accorde la paix, dit : “Si je disais ‘oui’, cela deviendrait obligatoire pour vous, mais vous ne seriez pas en mesure de l’accomplir.”» Mouslim 1337. Les musulmans sont unanimes sur le fait que le Hajj est obligatoire pour toute personne réunissant les conditions nécessaires à son accomplissement.
id: Menunaikan ibadah haji dan umrah adalah kewajiban sekali seumur hidup. Adapun jika seseorang melakukannya lebih dari satu kali, maka itu termasuk ibadah sunnah yang bernilai pahala tambahan. Haji dan umrah juga bisa menjadi wajib karena nadzar. Jika seseorang bernazar kepada Allah untuk menunaikan haji atau umrah, maka wajib baginya untuk menunaikan nadzarnya. Jika seseorang telah memulai haji atau umrah sunnah, maka ia wajib menyelesaikannya. Allah berfirman: «Sempurnakanlah haji dan umrah karena Allah.» (QS. Al-Baqarah: 196) Kewajiban haji didasarkan pada dalil-dalil dari Al-Qur'an, Sunnah, dan ijma' (kesepakatan) kaum muslimin. Allah Ta'ala berfirman: «Mengerjakan haji adalah kewajiban manusia terhadap Allah, yaitu (bagi) orang yang sanggup mengadakan perjalanan ke Baitullah. Barang siapa mengingkari (kewajiban haji), maka sesungguhnya Allah Maha Kaya (tidak memerlukan sesuatu) dari semesta alam.» (QS. Ali ‘Imran: 97) Rasulullah shallallahu 'alaihi wa sallam bersabda: “Islam dibangun di atas lima perkara: syahadat bahwa tidak ada ilah selain Allah dan bahwa Muhammad adalah utusan Allah, mendirikan shalat, menunaikan zakat, menunaikan haji, dan berpuasa di bulan Ramadan.” (HR. Bukhari, 8; Muslim, 16) Beliau juga bersabda: “Inti dari Islam adalah engkau bersaksi bahwa tidak ada ilah selain Allah, dan bahwa Muhammad adalah utusan Allah, mendirikan shalat, menunaikan zakat, berpuasa di bulan Ramadan, dan menunaikan haji ke Baitullah jika mampu melakukannya.” (HR. Muslim, 8) Diriwayatkan juga dari Abu Hurairah (semoga Allah meridhainya), bahwa Rasulullah shallallahu 'alaihi wa sallam menyampaikan khutbah dan berkata: “Wahai manusia, Allah telah mewajibkan atas kalian haji, maka laksanakanlah!” Seseorang bertanya: “Apakah setiap tahun, wahai Rasulullah?” Rasul pun diam hingga orang itu mengulang pertanyaannya tiga kali. Kemudian beliau bersabda: “Kalau aku jawab 'iya', niscaya itu menjadi kewajiban setiap tahun, dan kalian tidak akan mampu melaksanakannya.” (HR. Muslim, 1337) Kaum muslimin telah sepakat bahwa haji adalah wajib bagi siapa saja yang telah memenuhi seluruh syarat wajibnya.
ru: Совершение хаджа и ’умры обязательно один раз в течении жизни, а кто совершит их больше одного раза, то это уже будет считаться добровольным поклонением. Также хадж и ’умра могут стать обязательными после совершения обета (назра). Если человек дал обет перед Аллахом совершить хадж или ’умру, то обязательно нужно выполнить свой обет. Если человек уже начал совершать добровольный хадж или ’умру, то он обязан довести их до конца, ибо Аллах сказал: «Завершайте хадж и малое паломничество ради Аллаха». (Сура аль-Бакара, аят 196) Совершение хаджа обязательно из-за доводов из Корана и Сунны, а также по единогласному мнению мусульман (иджма’). Аллах Всевышний сказал: «Люди обязаны перед Аллахом совершить хадж к Дому (Каабе), если они способны проделать этот путь. Если же кто не уверует, то ведь Аллах не нуждается в мирах». (Сура али ’Имран, аят 97) Пророк, да благословит его Аллах и приветствует, сказал: “Ислам основывается на пяти (столпах): свидетельстве о том, что нет божества, достойного поклонения, кроме Аллаха, и что Мухаммад — посланник Аллаха, совершении намаза, выплате закята, совершении хаджа и соблюдении поста в Рамадане”. аль-Бухари, 8; Муслим, 16. А также: «(Суть) ислама заключается в том, чтобы ты засвидетельствовал, что нет божества, достойного поклонения, кроме Аллаха, и что Мухаммад - посланник Аллаха, совершал намаз, давал закят, соблюдал пост во время Рамадана и совершил хадж к Дому, если сумеешь сделать это». Муслим, 8. Также сообщается, что Абу Хурейра, да будет доволен им Аллах, сказал: «Однажды посланник Аллаха, да благословит его Аллах и приветствует, обратился к нам с проповедью и сказал: ″О люди, хадж был вменён вам в обязанность, так совершайте же его″. Один человек спросил: ″Каждый год, о посланник Аллаха?″ — однако пророк, да благословит его Аллах и приветствует, хранил молчание до тех пор, пока тот не задал свой вопрос трижды. Тогда посланник Аллаха, да благословит его Аллах и приветствует, сказал: ″Если я скажу: «Да» это непременно станет вашей обязанностью, но вы ведь не сможете выполнять её″». Муслим, 1337. И мусульмане единогласны, что хадж обязателен для того, в ком объединились все условия обязательности хаджа.
tr: Hac ve umrenin ömründe bir kez yapılması farzdır. Kim hac ve umreyi birden fazla yaparsa, bu artık nafile ibadet olur. Ayrıca, hac ve umre, adak olarak adandığında da farz hale gelir. Eğer bir kişi Allah’a hac veya umre yapacağına dair adakta bulunmuşsa, bu adağını yerine getirmesi gereklidir. Eğer kişi, nafile olarak hac veya umreye başlamışsa, artık onu tamamlaması gerekir. Çünkü Allah Teâlâ şöyle buyurmuştur: «Haccı ve umreyi Allah için tamamlayın.» (Bakara Suresi, 196. ayet). Haccın farz olduğu; Kur’an, Sünnet ve İslam âlimlerinin icmaı ile sabittir. Allah Teâlâ şöyle buyurmuştur: «İnsanlar, oraya gitmeye gücü yetenlerin Allah için Beytullah’ı haccetmeleri gerekir. Kim inkâr ederse bilsin ki Allah, âlemlerden müstağnidir.» (Âl-i İmran Suresi, 97. ayet). Resulullah (sallallahu aleyhi ve sellem) şöyle buyurmuştur: «İslam beş temel üzerine kurulmuştur: Allah’tan başka ilah olmadığına ve Muhammed’in O’nun resulü olduğuna şehadet etmek, namaz kılmak, zekât vermek, haccetmek ve Ramazan orucunu tutmak.» (Buhari, 8; Müslim, 16). Bir diğer hadiste ise: «İslam’ın esası, Allah’tan başka ilah olmadığına ve Muhammed’in O’nun resulü olduğuna şahitlik etmen, namaz kılman, zekât vermen, Ramazan orucunu tutman ve gücün yettiğinde Beytullah’ı haccetmendir.» (Müslim, 8). Ebu Hureyre’den (radıyallahu anh) rivayet edildiğine göre, Resulullah (sallallahu aleyhi ve sellem) bir gün hutbe vererek şöyle buyurdu: «Ey insanlar! Size hac farz kılındı, o halde haccı yerine getirin.» Bir adam sordu: «Ey Allah’ın Resulü! Her yıl mı?» Resulullah (sallallahu aleyhi ve sellem) ona cevap vermedi. Adam üç kez soruyu tekrarladıktan sonra Resulullah (sallallahu aleyhi ve sellem) şöyle buyurdu: «Eğer 'evet' deseydim, her yıl yapmak üzerinize farz olurdu, ancak siz bunu yerine getiremezdiniz.» (Müslim, 1337). Müslümanlar, haccın farz olduğu konusunda icma etmişlerdir. Haccın farz olabilmesi için gereken şartlar bir kişide bulunduğunda, onun için hac yapmak bir zorunluluktur.
