Repository: Saydulayev/umra
Catalog: umra/*.lproj/Localizable.strings
Languages: ar, de, fr, id, ru, tr

# hajj_umrah_virtues_text2
source: It is reported from the Mother of the Believers, ‘Aishah, may Allah be pleased with her, that she once said: «O Messenger of Allah, we consider jihad to be the best deed. Should we not participate in it?» The Prophet, peace and blessings be upon him, replied: «No! The best jihad for you (women) is an accepted Hajj.» Al-Bukhari 1520. In another narration, it is reported that ‘Aishah, may Allah be pleased with her, said: «O Messenger of Allah, are women required to perform jihad?» The Prophet, peace and blessings be upon him, replied: «Yes, they must perform a jihad in which there is no fighting, and that is Hajj and ‘Umrah.» Ibn Majah 2901.
de: Es wird von der Mutter der Gläubigen, ‘Aischa, möge Allah mit ihr zufrieden sein, überliefert, dass sie einmal sagte: «O Gesandter Allahs, wir betrachten den Dschihad als die beste Tat. Sollten wir nicht daran teilnehmen?» Der Prophet, Allahs Segen und Frieden seien auf ihm, antwortete: «Nein! Der beste Dschihad für euch (Frauen) ist ein makelloser Hajj.» Al-Bukhari 1520. In einer anderen Überlieferung wird berichtet, dass ‘Aischa, möge Allah mit ihr zufrieden sein, sagte: «O Gesandter Allahs, sind Frauen verpflichtet, Dschihad zu leisten?» Der Prophet, Allahs Segen und Frieden seien auf ihm, antwortete: «Ja, sie sind verpflichtet, einen Dschihad zu leisten, in dem es keinen Kampf gibt, und das ist Hajj und ‘Umrah.» Ibn Madschah 2901.
fr: Il est rapporté d’après la Mère des croyants, ‘Aïcha, qu’Allah soit satisfait d’elle, qu’un jour elle dit : «Ô Messager d’Allah, nous considérons le djihad comme la meilleure des actions. Ne devrions-nous pas y participer ?» Le Prophète, qu’Allah le bénisse et lui accorde la paix, répondit : «Non! Le meilleur djihad pour vous (les femmes) est un Hajj irréprochable.» Al-Boukhari 1520. Dans une autre version, il est rapporté que ‘Aïcha, qu’Allah soit satisfait d’elle, dit : «Ô Messager d’Allah, les femmes doivent-elles accomplir le djihad?» Le Prophète, qu’Allah le bénisse et lui accorde la paix, répondit : « Oui, elles doivent accomplir un djihad sans combat, et c’est le Hajj et la ‘Umrah. » Ibn Madjah 2901.
id: Diriwayatkan dari Ummul Mukminin ‘Aisyah (semoga Allah meridhainya), bahwa ia berkata: “Wahai Rasulullah, kami memandang jihad adalah amal yang paling utama. Bolehkah kami ikut berjihad?” Maka beliau shallallahu 'alaihi wa sallam menjawab: «Tidak! Jihad terbaik bagi kalian (kaum wanita) adalah haji yang mabrur.» (HR. Bukhari, 1520) Dalam riwayat lain disebutkan bahwa ‘Aisyah (semoga Allah meridhainya) berkata: “Wahai Rasulullah, apakah wanita juga wajib berjihad?” Beliau menjawab: «Bagi mereka ada jihad yang tidak mengandung peperangan, yaitu haji dan umrah.» (HR. Ibnu Majah, 2901)
ru: Сообщается со слов матери правоверных ‘Аиши, да будет доволен ею Аллах, что однажды она сказала: «О посланник Аллаха, мы считаем наилучшим делом джихад, так не принять ли нам в нём участие?» Пророк, да благословит его Аллах и приветствует, ответил: «Нет! Наилучшим джихадом для вас (женщин) является безупречный хадж». аль-Бухари, 1520. Также в другой версии сообщается, что ‘Аиша, да будет доволен ею Аллах, сказала: «О посланник Аллаха, должны ли женщины совершать джихад?» Пророк, да благословит его Аллах и приветствует, ответил: «Они должны совершать джихад, в котором нет сражения, а это хадж и ’умра». ибн Маджах, 2901.
tr: Müminlerin annesi Âişe’den (radıyallahu anha) rivayet edildiğine göre, bir gün şöyle dedi: «Ey Allah’ın Resulü! Biz, cihadın en faziletli amel olduğunu düşünüyoruz. Peki, biz de cihada katılmalı mıyız?» Resulullah (sallallahu aleyhi ve sellem) şöyle buyurdu: «Hayır! Sizin (kadınlar için) en faziletli cihadınız makbul bir hacdır.» (Buhari, 1520). Bir diğer rivayette ise Âişe (radıyallahu anha) şöyle demiştir: «Ey Allah’ın Resulü! Kadınlar cihad etmeli mi?» Resulullah (sallallahu aleyhi ve sellem) şöyle buyurdu: «Onlar, içinde savaş bulunmayan bir cihad yapmalıdır. Bu da hac ve umredir.» (İbn Mâce, 2901).

# hajj_umrah_virtues_text3
source: It is reported from Abu Hurayrah, may Allah be pleased with him, that the Prophet, peace and blessings be upon him, said: «Whoever performs Hajj for the sake of Allah, refraining from intimacy with their spouse and avoiding sin and improper conduct, will return home as pure as the day their mother gave birth to them.» Al-Bukhari 1521, Muslim 1350. It is also reported that the Prophet, peace and blessings be upon him, said to ‘Amr ibn al-‘As, may Allah be pleased with him: «Do you not know that Islam erases all that came before it, migration erases all that came before it, and Hajj erases all that came before it?» Muslim 121. An accepted Hajj (as mentioned in the hadiths above) is one that aligns with the Sunnah of the Messenger of Allah, peace and blessings be upon him.
de: Es wird von Abu Huraira, möge Allah mit ihm zufrieden sein, überliefert, dass der Prophet, Allahs Segen und Frieden seien auf ihm, sagte: «Wer Hajj allein für Allah verrichtet, sich seiner Ehefrau nicht nähert und keine sündhaften oder unwürdigen Handlungen begeht, wird nach Hause zurückkehren, so rein wie an dem Tag, an dem seine Mutter ihn geboren hat.» Al-Bukhari 1521, Muslim 1350. Es wird auch berichtet, dass der Prophet, Allahs Segen und Frieden seien auf ihm, zu ‘Amr ibn al-‘As, möge Allah mit ihm zufrieden sein, sagte: «Weißt du nicht, dass der Islam alles auslöscht, was davor war, dass die Hijra alles auslöscht, was davor war, und dass der Hajj alles auslöscht, was davor war?» Muslim 121. Ein makelloser Hajj (wie in den oben genannten Hadithen erwähnt) ist ein Hajj, der gemäß der Sunnah des Gesandten Allahs, Allahs Segen und Frieden seien auf ihm, verrichtet wird.
fr: Il est rapporté d’après Abu Hurayra, qu’Allah soit satisfait de lui, que le Prophète, qu’Allah le bénisse et lui accorde la paix, a dit : «Celui qui accomplit le Hajj pour Allah, sans approcher son épouse et sans commettre d’actes pécheurs ou indécents, reviendra chez lui aussi pur que le jour où sa mère l’a mis au monde.» Al-Boukhari 1521, Mouslim 1350. Il est également rapporté que le Prophète, qu’Allah le bénisse et lui accorde la paix, a dit à ‘Amr ibn al-‘As, qu’Allah soit satisfait de lui : «Ne sais-tu pas que l’Islam efface tout ce qui l’a précédé, que la Hijra efface tout ce qui l’a précédé, et que le Hajj efface tout ce qui l’a précédé?» Mouslim 121. Un Hajj irréprochable (mentionné dans les hadiths ci-dessus) est un Hajj accompli conformément à la Sunnah du Messager d’Allah, qu’Allah le bénisse et lui accorde la paix.
id: Diriwayatkan dari Abu Hurairah (semoga Allah meridhainya), bahwa Nabi shallallahu 'alaihi wa sallam bersabda: «Barang siapa yang menunaikan haji karena Allah, tidak melakukan rafats (hubungan suami-istri) dan tidak berbuat kefasikan, maka ia akan kembali (dari haji) seperti pada hari ia dilahirkan oleh ibunya.» (HR. Bukhari, 1521; Muslim, 1350) Juga diriwayatkan bahwa Rasulullah shallallahu 'alaihi wa sallam berkata kepada ‘Amr bin Al-‘Ash (semoga Allah meridhainya): «Tidakkah engkau tahu bahwa Islam menghapus semua dosa sebelumnya, hijrah menghapus semua dosa sebelumnya, dan haji juga menghapus semua dosa sebelumnya?» (HR. Muslim, 121) Haji yang mabrur, sebagaimana disebutkan dalam hadis-hadis di atas, adalah haji yang sesuai dengan sunnah Rasulullah shallallahu 'alaihi wa sallam.
ru: Сообщается со слов Абу Хурейры, да будет доволен им Аллах, что пророк, да благословит его Аллах и приветствует, сказал: «Тот, кто совершит хадж ради Аллаха, не приблизившись к своей жене и не совершив ничего греховного и недостойного, вернётся домой таким же, каким был он в тот день, когда родила его мать». аль-Бухари, 1521; Муслим, 1350. Сообщается также, что пророк, да благословит его Аллах и приветствует, сказал ’Амру ибн аль-’Асу, да будет доволен им Аллах: «Разве тебе не известно, что ислам уничтожает всё, что было прежде, и хиджра уничтожает всё, что было прежде, и хадж уничтожает всё, что было прежде?» Муслим, 121. Безупречный хадж, (о котором сказано в вышеперечисленных хадисах), это такой хадж, который соответствует сунне посланника Аллаха, да благословит его Аллах и приветствует.
tr: Ebu Hureyre’den (radıyallahu anh) rivayet edildiğine göre, Resulullah (sallallahu aleyhi ve sellem) şöyle buyurmuştur: «Kim Allah için hacceder ve bu esnada eşiyle ilişkiye girmez, günah işlemez ve kötü söz söylemezse, annesinden doğduğu günkü gibi günahlarından arınmış olarak döner.» (Buhari, 1521; Müslim, 1350). Ayrıca Resulullah (sallallahu aleyhi ve sellem), Amr ibn Âs’a (radıyallahu anh) şöyle buyurmuştur: «Bilmiyor musun ki, İslam, daha önce işlenen günahları siler? Hicret, daha önce işlenen günahları siler. Hac da daha önce işlenen günahları siler.» (Müslim, 121). Hadislerde geçen “makbul hac” (hacc-ı mebrur), Resulullah’ın (sallallahu aleyhi ve sellem) sünnetine uygun bir şekilde yerine getirilen hacdır.

# hajj_umrah_virtues_text4
source: It is reported from Jabir, may Allah be pleased with him, that the Prophet, peace and blessings be upon him, said: «Learn your religious rituals from me, for I do not know—perhaps this Hajj of mine will be the last pilgrimage I perform.» Muslim 1297. In another version of this hadith, it is reported that the Prophet, peace and blessings be upon him, said: «O people, learn your religious rituals from me, for I do not know—perhaps I will not perform Hajj after this year.» An-Nasa’i 3062.
de: Es wird von Jabir, möge Allah mit ihm zufrieden sein, überliefert, dass der Prophet, Allahs Segen und Frieden seien auf ihm, sagte: «Lernt eure religiösen Rituale von mir, denn ich weiß nicht – vielleicht werde ich nach diesem Hajj niemals mehr eine Pilgerfahrt verrichten.» Muslim 1297. In einer anderen Version dieses Hadiths wird berichtet, dass der Prophet, Allahs Segen und Frieden seien auf ihm, sagte: «O Menschen, lernt eure religiösen Rituale von mir, denn ich weiß nicht – vielleicht werde ich nach diesem Jahr keinen weiteren Hajj verrichten.» An-Nasai 3062.
fr: Il est rapporté d’après Jabir, qu’Allah soit satisfait de lui, que le Prophète, qu’Allah le bénisse et lui accorde la paix, a dit : «Prenez de moi vos rites religieux, car je ne sais pas – peut-être que, après ce Hajj, je n’accomplirai plus jamais le pèlerinage.» Mouslim 1297. Dans une autre version de ce hadith, il est rapporté que le Prophète, qu’Allah le bénisse et lui accorde la paix, a dit : «Ô gens, prenez de moi vos rites religieux, car je ne sais pas – peut-être que je n’accomplirai plus de Hajj après cette année.» An-Nassa’i 3062.
id: Diriwayatkan dari Jabir (semoga Allah meridhainya), bahwa Nabi shallallahu 'alaihi wa sallam bersabda: «Ambillah dariku tata cara ibadah kalian, karena aku tidak tahu, mungkin setelah tahun ini aku tidak akan lagi menunaikan haji.» (HR. Muslim, 1297) Dalam riwayat lain disebutkan bahwa beliau bersabda: «Wahai manusia, ambillah dariku tata cara ibadah kalian, karena aku tidak tahu apakah aku masih akan menunaikan haji setelah tahun ini.» (HR. An-Nasa’i, 3062)
ru: Сообщается со слов Джабира, да будет доволен им Аллах, что пророк, да благословит его Аллах и приветствует, сказал: «Перенимайте от меня ваши религиозные обряды, ибо я не знаю — может быть, после этого моего хаджа я уже никогда не совершу паломничества». Муслим, 1297. В другой версии этого хадиса сообщается, что пророк, да благословит его Аллах и приветствует, сказал: «О люди, перенимайте от меня ваши религиозные обряды, ибо я не знаю — может быть, я не совершу больше хаджа после этого года». ан-Насаи, 3062.
tr: Câbir’den (radıyallahu anh) rivayet edildiğine göre, Resulullah (sallallahu aleyhi ve sellem) şöyle buyurmuştur: «Benden hac menasikini öğrenin! Çünkü ben, bu hactan sonra bir daha hac yapamayabilirim.» (Müslim, 1297). Bu hadisin bir başka rivayetinde ise Resulullah (sallallahu aleyhi ve sellem) şöyle buyurmuştur: «Ey insanlar! Hac menasikini benden öğrenin. Çünkü bu yıldan sonra bir daha hac yapmayabilirim.» (Nesâî, 3062).
