Repository: Saydulayev/umra
Catalog: umra/*.lproj/Localizable.strings
Languages: ar, de, fr, id, ru, tr

# Remembrance of Allah during the Sa'i of Safa and Marwa.
source: Allahu Akbar! Allahu Akbar! Allahu Akbar! La ilaha illa-Llahu wahdahu la sharika lahu. Lahul mulku wa lahul hamdu yuhyi wa yumitu wa huwa 'ala kulli shay'in qodir. La ilaha illa-Llahu wahdahu la sharika lah, anjaza wa'dahu, wa nasaro 'abdahu, wa hazamal ahzaba wahdahu «Allah is the Greatest, Allah is the Greatest, Allah is the Greatest! There is no deity except Allah, the One without any partners! To Him belongs the power and to Him belongs all praise. He gives life and causes death, and He has power over all things. There is no deity except Allah, the One without any partners! He fulfilled His promise, aided His servant, and alone defeated the hostile tribes.» Recite these words three times, raising your hands for supplication (dua) after the first and second recitations. Then begin walking from Safa to Marwa. Walking from Safa to Marwa counts as one round, and the return from Marwa to Safa counts as the second round. At the top of Marwa, repeat the same pattern: zikr — dua — zikr — dua — zikr, raising your hands for dua after the first and second recitations. This zikr and dua should be repeated every time you ascend Safa or Marwa, except for the seventh and final round. Upon reaching the first green marker, men should run until the second marker, and the rest of the path should be walked at a normal pace. During the Sa'i ritual, you can supplicate to Allah with the following prayer
ar: ردد هذا الذكر ثلاث مرات، وارفع يديك للدعاء بعد الذكر الأول والثاني. ثم ابدأ السعي من جبل الصفا باتجاه المروة. يعد السعي من الصفا إلى المروة مرة واحدة، والعودة من المروة إلى الصفا مرة ثانية. عند الوصول إلى جبل المروة، كرر نفس الترتيب: ذكر – دعاء – ذكر – دعاء – ذكر. يتم تكرار هذه الأذكار والدعاء في كل مرة تصعد فيها إلى الصفا والمروة، ما عدا في الشوط السابع. عند الوصول إلى العلامة الأولى المميزة باللون الأخضر، يجب على الرجال الركض حتى العلامة الثانية. باقي الطريق يتم مشيه بخطوات عادية. أثناء السعي، يمكنك الدعاء بهذا الدعاء:
de: Allahu Akbar! Allahu Akbar! Allahu Akbar! La ilaha illa-Llahu wahdahu la sharika lahu. Lahul mulku wa lahul hamdu yuhyi wa yumitu wa huwa 'ala kulli shay'in qodir. La ilaha illa-Llahu wahdahu la sharika lah, anjaza wa'dahu, wa nasaro 'abdahu, wa hazamal ahzaba wahdahu «Allah ist groß, Allah ist groß, Allah ist groß! Es gibt keinen Gott außer Allah, dem Einen, der keinen Partner hat! Ihm gehört die Macht und Ihm gebührt der Lobpreis. Er belebt und tötet, und Er hat die Herrschaft über alles Existierende! Es gibt keinen Gott außer einem einzigen Allah, dem Einen, der keinen Partner hat! Er hat Sein Versprechen erfüllt, Seinem Diener geholfen und allein die feindlichen Stämme besiegt.» Rezitiere diese Worte dreimal und erhebe dabei nach dem ersten und zweiten Mal die Hände für das Bittgebet (Dua). Beginne dann den Weg von Safa nach Marwa. Ein Durchgang von Safa nach Marwa zählt als eine Runde, der Rückweg von Marwa nach Safa als die zweite Runde. Oben auf Marwa wiederhole dasselbe Muster: Zikr — Dua — Zikr — Dua — Zikr, wobei du nach dem ersten und zweiten Mal die Hände für das Dua erhebst. Dieser Zikr und das Dua sollten jedes Mal wiederholt werden, wenn du Safa oder Marwa besteigst, außer bei der siebten und letzten Runde. Männer sollten beim Erreichen der ersten grünen Markierung bis zur zweiten Markierung laufen, den restlichen Weg geht man in normalem Tempo. Während des Sa'i-Rituals können Sie zu Allah mit folgendem Gebet sprechen:
fr: Allahu Akbar! Allahu Akbar! Allahu Akbar! La ilaha illa-Llohu wahdahu la sharika lah! Lahul mulku wa lahul hamdu yuhyi wa yumitu wa huwa 'ala kulli shay'in qodir! La ilaha illa Llahu wahdahu la sharika lah anjaza wa'dah wa nasara 'abdah wa hazama al-ahzaba wahdah. «Allah est Grand, Allah est Grand, Allah est Grand! Il n’y a pas de divinité à part Allah, l’Unique, qui n’a pas d’associé! À Lui appartient la royauté et à Lui revient la louange, Il donne la vie et la mort, et Il est Puissant sur toutes choses! Il n’y a pas de divinité à part Allah, l’Unique, qui n’a pas d’associé! Il a accompli Sa promesse, aidé Son serviteur et seul Il a vaincu les clans ennemis» Récitez ces paroles trois fois, en levant les mains pour la supplication après la première et la deuxième fois. Ensuite, commencez le passage de la colline de Safa à celle de Marwa. Un passage de Safa à Marwa compte pour un tour, et le chemin de retour est compté comme un autre tour. Sur la colline de Marwa, répétez le même ordre: Dhikr – supplication – Dhikr – supplication – Dhikr. Ces Dhikr et supplications doivent être répétés à chaque montée sur Safa et Marwa, sauf lors du septième passage. En atteignant la première marque verte, les hommes doivent courir jusqu’à la deuxième marque verte. Le reste du chemin se fait en marchant normalement. Pendant le rituel du Sa’i, vous pouvez adresser cette supplication à Allah:
id: Allāhu akbar! Allāhu akbar! Allāhu akbar! Lā ilāha illallāhu waḥdahu lā syarīka lah. Lahul-mulku wa lahul-ḥamdu yuḥyī wa yumītu wa huwa ‘alā kulli syai’in qadīr. Lā ilāha illallāhu waḥdahu lā syarīka lah, anjaza wa‘dah, wa naṣara ‘abdah, wa hazamal-aḥzāba waḥdah. «Allah Maha Besar, Allah Maha Besar, Allah Maha Besar! Tiada Tuhan selain Allah semata, tiada sekutu bagi-Nya! Milik-Nya segala kerajaan dan pujian. Dia yang menghidupkan dan mematikan, dan Dia Maha Kuasa atas segala sesuatu! Tiada Tuhan selain Allah semata, tiada sekutu bagi-Nya! Dialah yang menepati janji-Nya, menolong hamba-Nya, dan menghancurkan golongan musuh sendirian.» Bacalah doa ini sebanyak tiga kali, mengangkat kedua tangan untuk berdoa setelah membaca yang pertama dan kedua. Kemudian mulailah berjalan dari bukit Safa menuju bukit Marwah. Satu kali perjalanan dari Safa ke Marwah dihitung sebagai satu putaran, dan kembali dari Marwah ke Safa dihitung sebagai putaran kedua. Di atas bukit Marwah, ulangilah urutan bacaan zikir—doa—zikir—doa—zikir ini. Bacaan zikir dan doa ini diulang setiap kali menaiki Safa dan Marwah, kecuali pada perjalanan yang ketujuh. Ketika mencapai tanda hijau pertama, laki-laki dianjurkan berlari kecil hingga mencapai tanda hijau kedua. Selebihnya dilalui dengan berjalan biasa. Selama melaksanakan Sa'i, boleh berdoa dengan doa berikut ini:
ru: Аллаhу акбар! Аллаhу акбар! Аллаhу акбар! Ля иляhа илля-ЛлАhу вахьдаhу ля шарика ляhу! Ляhуль мульку ва ляhуль хьамду йухьйи ва йумиту ва hува 'аля кулли шайъин къодиир! Ля иляhа илля Ллohу вахьдаhу ля шарика ляhу анджаза ва'даh, ва насо-ро 'абдаh, ва hазамаль ахьзаба вахьдаh. «Аллах Превелик, Аллах Превелик, Аллах Превелик! Нет божества, кроме Аллаhа, Одного, у Которого нет сотоварища! Ему принадлежит власть и надлежит хвала, Он оживляет и умерщвляет, и Он властен над всем сущим! Нет божества, кроме одного Аллаhа, у Которого нет сотоварища! Он выполнил Свое обещание, помог Своему рабу и в одиночку разбил враждебные племена» Произнесите эти слова три раза, поднимая руки для дуа после первого и второго раза. Затем начните прохождение от холма Сафа к Марве. Одно прохождение от Сафы до Марвы считается одним разом, а обратный путь — уже вторым. На холме Марва повторите тот же порядок: зикр — дуа — зикр — дуа — зикр. Эти зикры и дуа следует повторять на каждом подъёме на Сафа и Марву, кроме седьмого прохождения. Дойдя до первой отметки, обозначенной зелёным цветом, мужчинам необходимо пробежать до второй отметки. Остальной путь совершается обычным шагом. Во время обряда са‘й можно обратиться к Аллаху с такой мольбой:
tr: Allahu Akbar! Allahu Akbar! Allahu Akbar! La ilaha illa-Llahu wahdahu la sharika lahu. Lahul mulku wa lahul hamdu yuhyi wa yumitu wa huwa 'ala kulli shay'in qodir. La ilaha illa-Llahu wahdahu la sharika lah, anjaza wa'dahu, wa nasaro 'abdahu, wa hazamal ahzaba wahdahu. «Allah en büyüktür! Allah en büyüktür! Allah en büyüktür! Allah’tan başka ilah yoktur, O tektir ve O’nun ortağı yoktur! Mülk O’nundur, hamd O’na aittir. O, diriltir ve öldürür. O, her şeye kadirdir! Allah’tan başka ilah yoktur, O tektir ve O’nun ortağı yoktur! O, vaadini yerine getirdi, kuluna yardım etti ve düşman birliklerini tek başına mağlup etti.» Bu sözleri üç kez tekrarlayın ve ilk iki kez ellerinizi kaldırarak dua edin. Sonra Safa’dan Merve’ye doğru yürümeye başlayın. Safa’dan Merve’ye gitmek bir tur, Merve’den Safa’ya dönmek ikinci tur olarak sayılır. Merve tepesine ulaştığınızda aynı düzeni tekrar edin: zikir – dua – zikir – dua – zikir. Eller dua için ilk iki tekrarda kaldırılmalıdır. Bu zikir ve dualar, yedinci ve son tur hariç, Safa ve Merve tepelerine her çıkışta tekrarlanmalıdır. Yeşil işaretli ilk noktaya ulaştığınızda, erkekler ikinci işarete kadar hızlı koşmalıdır. Yolun geri kalanı normal yürüyerek tamamlanmalıdır. Sa‘y ibadeti sırasında şu duayı okuyabilirsiniz:

# Du'a during the Sa'i ritual of Safa and Marwa.
source: Rabbi-ghfir wa rham, innaka anta a´azzul-akram «O Lord, forgive and have mercy, for You are the Most Great and Generous!», There is nothing wrong with this, as this supplication is established by a whole group of righteous predecessors. After the seventh round, the pilgrim ceases to recite Zikr and Dua on the Marwa hill. This marks the completion of the Sa'i ritual. Prayer upon exiting the Sacred Mosque. After completing the seventh circuit on the hill of Marwa, exit the Sacred Mosque with your left foot, saying:
ar: ولا حرج في ذلك، فقد ورد هذا الدعاء عن مجموعة من السلف الصالح. عند الانتهاء من الشوط السابع، يتوقف الحاج عن ذكر الله والدعاء عند جبل المروة. هذا يعني انتهاء السعي. دعاء عند الخروج من المسجد الحرام. بعد الانتهاء من الشوط السابع عند جبل المروة، اخرج من المسجد الحرام بالقدم اليسرى وقل:
de: Rabbi-ghfir wa rham, innaka anta a´azzul-akram «Herr, vergib und erbarme dich, denn Вu bist der Allergrößte und Barmherzigste!», Es ist nichts Schlechtes daran, da dieses Gebet von einer ganzen Gruppe rechtschaffener Vorgänger festgelegt wurde. Nach dem siebten Rundgang hört der Pilger auf, Zikr und Dua auf dem Hügel Marwa zu rezitieren. Das markiert den Abschluss des Sa'i-Ritus. Das Gebet beim Verlassen der Heiligen Moschee. Nachdem du die siebte Runde auf dem Hügel von Marwa abgeschlossen hast, verlasse die Heilige Moschee mit dem linken Fuß und sage:
fr: Robbi-ghfir wa-rham, innaka antal a'azzul akram «Seigneur, pardonne et fais miséricorde, car Tu es le Plus Grand et le Plus Noble!», cela n’est pas blâmable, car cette supplication a été rapportée par plusieurs pieux prédécesseurs. À la fin du septième passage, le pèlerin ne récite plus de Dhikr ni de supplication sur la colline de Marwa. Cela signifie que le rituel du Sa’i est terminé. Supplication en sortant de la Mosquée Sacrée. Après avoir terminé le septième passage sur la colline de Marwa, sortez de la Mosquée Sacrée avec le pied gauche en disant:
id: Rabbighfir warḥam, innaka antal-a‘azzul-akram. «Ya Rabb, ampunilah dan rahmatilah aku, sesungguhnya Engkaulah Yang Maha Perkasa lagi Maha Mulia.» Doa ini dibolehkan, karena telah diamalkan oleh sejumlah ulama salaf yang saleh. Setelah menyelesaikan perjalanan yang ketujuh, jamaah tidak lagi mengucapkan zikir dan doa di atas bukit Marwah. Ini menandakan bahwa Sa'i telah selesai. Doa ketika keluar dari Masjidil Haram. Setelah menyelesaikan perjalanan ketujuh di bukit Marwah, keluarlah dari Masjidil Haram dengan kaki kiri sambil membaca doa berikut:
ru: Рабби-г1фир ва-рхьам, иннакя анталь а'аззу-ль-акрам «Господи, прости и помилуй, ибо Ты – Самый Великий и Великодушный!», в этом нет ничего плохого, поскольку эта мольба установлена от целой группы праведных предшественников. По завершении седьмого обхода, паломник больше не произносит зикр и дуа на холме Марва. Это означает, что обряд Са'й завершён. Мольба при выходе из Заповедной мечети. Завершив седьмое прохождение на холме Марва, выйдите из Заповедной мечети с левой ноги, сказав:
tr: Rabbi-ghfir wa rham, innaka anta a´azzul-akram «Ey Rabbim! Beni bağışla ve merhamet et! Şüphesiz Sen, en yüce ve en cömert olansın!» Bu duayı okumakta bir sakınca yoktur, çünkü selef alimlerinden bir grup tarafından kabul edilmiştir. Yedinci turun tamamlanmasının ardından, artık Merve tepesinde zikir ve dua yapılmaz. Bu, sa‘y ibadetinin tamamlandığını gösterir. Mescid-i Haram’dan çıkarken yapılan dua: Yedinci turun sonunda Merve tepesinde sa‘y ibadetini tamamladıktan sonra, sol ayağınızla Mescid-i Haram’dan çıkarken şu duayı okuyun:

# Du'a upon exiting the Sacred Mosque.
source: Allahumma solli 'ala Muhammadin wa sallim! Allahumma, inni as'aluka min fadlika! O Allah, bless Muhammad and grant him peace! O Allah, indeed, I ask You for Your Mercy!
de: Allahumma solli 'ala Muhammadin wa sallim! Allahumma, inni as'aluka min fadlika! Oh Allah, segne Muhammad und schenke ihm Frieden! Oh Allah, wahrlich, ich bitte Dich um Deine Gnade!
fr: Allahumma solli 'ala Muhammadin wa sallim! Allahumma inni as aluka min fadzlik! Ô Allah, bénis Muhammad et accorde-lui la paix! Ô Allah, en vérité, je Te demande Ta Grâce!
id: Allāhumma ṣalli ‘alā Muḥammadin wa sallim! Allāhumma innī as'aluka min faḍlik! Ya Allah, limpahkanlah salawat dan salam kepada Nabi Muhammad! Ya Allah, sesungguhnya aku memohon kepada-Mu dari karunia-Mu!
ru: Аллаhумма, солли 1аля Мухьаммадин ва саллим! Аллаhумма, инни ас’алю-ка мин фадли-ка! О Аллах, благослови Мухаммада и ниспошли ему мир! О Аллах, воистину, я прошу Тебя о Милости Твоей!
tr: Allahumma solli 'ala Muhammadin wa sallim! Allahumma, inni as'aluka min fadlika! «Ey Allah’ım! Muhammed’e salât ve selam eyle! Ey Allah’ım! Şüphesiz, Senin lütfunu diliyorum!»

# Shaving the head string
source: Shaving the head or trimming the hair.
ar: حلق الرأس أو تقصير الشعر.
de: Das Rasieren des Kopfes oder das Kürzen der Haare.
fr: Se raser la tête ou couper les cheveux.
id: Mencukur atau Memendekkan Rambut.
ru: Бритьё головы либо укорачивание волос.
tr: Başı tıraş etmek veya saçları kısaltmak.

# Men shorten or shave their hair.
source: Then the man evenly trims his hair on his head or shaves it off, while the woman cuts a lock of hair equivalent to the length of a finger joint. Note: It is preferable for those who have arrived for Hajj to trim their hair if they do not have enough time for it to grow back before Hajj, as shaving the head is done during Hajj. For those who have come only to perform Umrah (without Hajj), it is better to shave the head. The complete exit from the state of Ihram. With this, the Umrah is completed. The man removes the Ihram attire. The restrictions that were applicable in the state of Ihram are lifted.
ar: ثم يقوم الرجل بتقصير شعر رأسه بالتساوي أو بحلقه بالكامل، أما المرأة فتقص خصلة بحجم ثلث إصبع. ملاحظة: يفضل لمن قدم للحج أن يقصر شعره إذا لم يكن سينمو مرة أخرى قبل الحج، لأن حلق الرأس يتم في الحج. أما من قدم لأداء العمرة فقط (دون حج) فالأفضل له أن يحلق رأسه. الخروج الكامل من الإحرام. بهذا تكون العمرة قد انتهت. يخلع الرجل لباس الإحرام، وترفع القيود التي كانت مفروضة أثناء الإحرام.
de: Dann schneidet der Mann seine Haare auf dem Kopf gleichmäßig ab oder rasiert sie ganz ab, während die Frau eine Haarsträhne abschneidet, die etwa so dick ist wie ein Daumen. Anmerkung: Es ist besser für diejenigen, die zur Hadsch kommen, ihre Haare zu schneiden, wenn sie nicht genug Zeit haben, um sie zwischen der Umrah und der Hadsch wieder wachsen zu lassen, da das Schneiden der Haare während der Hadsch-Zeremonie erfolgt. Für diejenigen, die nur die Umrah (ohne Hadsch) machen, ist es besser, den Kopf zu rasieren. Vollständiges Beenden des Ihram-Zustands. Damit ist die Umrah abgeschlossen. Der Mann zieht die Ihram-Kleidung aus. Die Beschränkungen, die im Ihram-Zustand galten, sind aufgehoben.
fr: Ensuite, l’homme égalise la longueur de ses cheveux ou rase sa tête, tandis que la femme coupe une mèche de la taille d’un tiers de doigt. Remarque: Pour ceux venus pour le Hajj, il est préférable de couper les cheveux s’ils n’ont pas le temps de repousser entre la ‘Umra et le Hajj, car le rasage de la tête se fait pendant le Hajj. Pour ceux qui viennent uniquement pour la ‘Umra (sans Hajj), il est préférable de se raser la tête. Sortie complète de l’état d’Ihram. À ce stade, la ‘Umra est terminée. L’homme enlève le vêtement d’Ihram. Les restrictions imposées en état d’Ihram sont levées.
id: Selanjutnya, laki-laki hendaknya mencukur atau merapikan rambutnya secara merata, sementara wanita cukup memotong sebagian rambutnya sepanjang sepertiga ruas jari. Catatan: Bagi jamaah yang datang untuk menunaikan haji, dianjurkan untuk memendekkan rambut jika dikhawatirkan rambutnya tidak akan tumbuh lagi hingga pelaksanaan haji setelah Umrah, sebab mencukur rambut akan dilakukan pada waktu ibadah haji. Sedangkan bagi jamaah yang hanya melaksanakan Umrah (tanpa haji), lebih utama untuk mencukur habis rambutnya. Dengan ini, seseorang telah sepenuhnya keluar dari keadaan Ihram. Pada tahap ini, ibadah Umrah selesai. Laki-laki boleh melepas pakaian Ihramnya, dan semua larangan dalam keadaan Ihram sudah tidak berlaku lagi.
ru: Затем мужчина равномерно укорачивает волосы на своей голове либо сбривает её, а женщина состригает локон величиной с треть пальца. Примечание: Приехавшим в хадж лучше укоротить волосы, если они не успеют отрасти после ‘умры до хаджа, так как бритьё головы совершается во время хаджа. Приехавшим совершить только ‘умру (без хаджа) лучше обрить голову. Полный выход из состояния ихрама. На этом ‘умра заканчивается. Мужчина снимает одеяние ихрам. Ограничения, действовавшие в состоянии ихрама, сняты.
tr: Daha sonra erkekler başındaki saçları eşit şekilde kısaltır veya tamamen tıraş eder, kadınlar ise saçlarından bir parmak boğumu kadar keser. Not: Hac için gelenlerin, saçları umreden sonra hacca kadar uzamayacaksa, tıraş yerine saçlarını kısaltmaları daha faziletlidir. Çünkü saç tıraşı hac esnasında yapılır. Yalnızca umre yapmak için gelenlerin ise saçlarını tamamen tıraş etmeleri daha faziletlidir. İhramdan tamamen çıkış gerçekleşir. Böylece umre ibadeti tamamlanmış olur. Erkekler ihram elbiselerini çıkarır. İhram halindeyken geçerli olan yasaklar artık kaldırılmıştır.

# Du'a at the end.
source: In conclusion, I ask the Most High Allah to accept our good deeds and to preserve for us the reward for their performance until the day when we meet Him, «on the day when wealth and sons will not be of any use to anyone, except for those who come to Allah with a sound heart» (Surah Poets, verses 88-89). Praise be to Allah, the Lord of the worlds!
ar: وفي الختام، أسأل الله العلي العظيم أن يتقبل منا صالح أعمالنا ويحفظ لنا أجرها إلى يوم نلقاه فيه، «يوم لا ينفع مال ولا بنون، إلا من أتى الله بقلب سليم» (سورة الشعراء، الآيتان 88-89). الحمد لله رب العالمين!
de: Abschließend bitte ich Allah, den Allmächtigen, all unsere guten Taten anzunehmen und uns die Belohnung dafür zu bewahren bis zu dem Tag, an dem wir Ihm begegnen, „Der Tag, an dem weder Vermögen noch Kinder von Nutzen sein werden, außer für diejenigen, die mit einem reinen Herzen zu Allah kommen“ (Sure Ash-Shu'ara, Ayahs 88–89). Ich bitte Allah auch, allen, die zur Entwicklung, Verbesserung und Verbreitung dieser Anwendung beigetragen haben — sei es durch Rat, Wissen, finanzielle Unterstützung oder freundliche Worte — die volle Belohnung zu gewähren, für jede Umrah, die mit ihrer Hilfe vollzogen wird. Wie der Gesandte Allahs (Friede und Segen seien auf ihm) sagte: „Wer auf eine gute Tat hinweist, erhält eine Belohnung, die derjenigen des Ausführenden gleichkommt“ (Sahih Muslim, Nr. 1893). Gepriesen sei Allah, der Herr der Welten!
fr: En conclusion, je demande à Allah, le Tout-Puissant, d'accepter toutes nos bonnes actions et de préserver leur récompense jusqu'au Jour où nous Le rencontrerons, « Le Jour où ni la richesse ni les enfants ne seront d'aucune utilité, sauf pour ceux qui se présenteront à Allah avec un cœur pur » (Sourate Ash-Shu’ara, Versets 88–89). Je demande également à Allah d'accorder une récompense complète à tous ceux qui ont contribué au développement, à l'amélioration et à la diffusion de cette application — que ce soit par des conseils, des connaissances, un soutien financier ou des paroles bienveillantes — pour chaque Omra accomplie grâce à son aide. Comme l'a dit le Messager d'Allah (paix et bénédictions d’Allah sur lui) : « Celui qui indique une bonne action recevra une récompense égale à celle de celui qui la réalise » (Sahih Mouslim, n° 1893). Louange à Allah, le Seigneur des mondes !
id: Sebagai penutup, aku memohon kepada Allah Yang Maha Tinggi agar menerima semua amal baik kita dan menjaga pahala dari amal-amal tersebut hingga hari pertemuan kita dengan-Nya, «Pada hari ketika harta dan anak-anak tidak lagi memberi manfaat, kecuali mereka yang menghadap Allah dengan hati yang bersih.» (QS. Asy-Syu‘ara [26]: 88–89). Aku juga berdoa kepada Allah Yang Maha Tinggi agar memberikan pahala penuh kepada semua orang yang telah berkontribusi dalam membuat, mengembangkan, serta menyebarluaskan aplikasi ini—baik melalui nasihat, ilmu, harta, atau kata-kata baik—atas setiap Umrah yang dikerjakan melalui bantuannya. Sebagaimana sabda Rasulullah (shallallahu 'alaihi wa sallam): «Barangsiapa menunjukkan kepada suatu kebaikan, maka dia mendapatkan pahala seperti pahala orang yang melakukannya.» (HR. Muslim, no. 1893). Segala puji bagi Allah, Rabb semesta alam!
ru: В заключение я прошу Всевышнего Аллаха принять все наши благие дела и сохранить нам награду за их совершение вплоть до того Дня, когда мы с Ним встретимся, «в тот День, когда ни богатство, ни сыновья не принесут пользы никому, кроме тех, которые предстанут перед Аллахом с непорочным сердцем» (Сура «Поэты», аяты 88–89). Я также прошу Всевышнего Аллаха даровать полную награду всем, кто участвовал в создании, развитии и распространении этого приложения — будь то советом, знаниями, средствами или добрым словом — за каждую Умру, совершённую с его помощью. Как сказал Посланник Аллаха (мир ему и благословение Аллаха): «Кто указывает на благое, тот получит такую же награду, как и тот, кто совершает это благое дело» (Сахих Муслим, № 1893). Хвала Аллаху, Господу миров!
tr: Son olarak, Yüce Allah’tan tüm salih amellerimizi kabul etmesini ve bu amellerimizin sevabını, O’nun huzuruna çıkacağımız güne kadar korumasını diliyorum. «O gün ki, ne mal fayda verir ne de oğullar. Ancak Allah’a selim bir kalple gelenler müstesna.» (Şuara Suresi, 88–89. ayetler). Ayrıca, bu uygulamanın oluşturulmasına, geliştirilmesine ve yayılmasına herhangi bir şekilde katkıda bulunan herkese – ister bir tavsiye, ister ilim, ister maddi destek veya güzel bir söz olsun – Allah’ın tam mükafat vermesini niyaz ediyorum. Çünkü Allah Resulü (sallallahu aleyhi ve sellem) şöyle buyurmuştur: «Kim bir hayra vesile olursa, onu yapanın sevabı kadar sevap kazanır.» (Sahih Müslim, Hadis No: 1893). Alemlerin Rabbi olan Allah’a hamdolsun!

# feedback_settings_screen_string
source: FEEDBACK
ar: التعليقات
fr: COMMENTAIRES
id: MASUKAN
tr: GERİ BİLDİRİM

# text_button_feedback_string
source: Feedback
ar: إرسال تعليق
fr: Retour d'information
id: Kirim Masukan
ru: Обратная связь
tr: Geri Bildirim

# evaluate_the_app_string
source: EVALUATE THE APP
ar: تقييم التطبيق
fr: ÉVALUER L'APPLICATION
id: NILAI APLIKASI
tr: UYGULAMAYI DEĞERLENDİRİN

# text_button_rate_the_app_string
source: Evaluate the app
ar: قيم التطبيق
de: Bewerte die App
fr: Évaluer l'application
id: Beri Nilai Aplikasi
ru: Оценить приложение
tr: Uygulamayı Değerlendir

# support_the_developer_string
source: SUPPORT THE DEVELOPER
ar: دعم المطور
fr: SOUTENIR LE DÉVELOPPEUR
id: DUKUNG PENGEMBANG
tr: GELİŞTİRİCİYİ DESTEKLEYİN

# text_button_support_string
source: Support the developer
ar: ادعم المطور
de: Entwickler unterstützen
fr: Soutenir le développeur
id: Dukung Pengembang
ru: Поддержать разработчика
tr: Geliştiriciyi Destekle

# select_language_settings_string
source: Select language
ar: اختر اللغة
de: Sprache auswählen
fr: Choisir la langue
id: Pilih Bahasa
ru: Выбрать язык
tr: Dili Seç
