Repository: Saydulayev/umra
Catalog: umra/*.lproj/Localizable.strings
Languages: ar, de, fr, id, ru, tr

# Having completed seven circuits around the Kaaba
source: Having completed the seven rounds around the Kaaba, the man covers his right shoulder. Then head towards the place of Ibrahim's standing and say:
ar: بعد الانتهاء من الطواف حول الكعبة سبع مرات، يقوم الرجل بتغطية كتفه الأيمن. ثم توجه إلى مقام إبراهيم وقل:
de: Nachdem der Pilger die siebenfache Umkreisung um die Kaaba abgeschlossen hat, bedeckt der Mann seine rechte Schulter. Dann begibt er sich zum Ort, an dem Ibrahim stand, und sagt:
fr: Après avoir terminé les sept tours autour de la Kaaba, l’homme couvre son épaule droite. Ensuite, dirigez-vous vers le lieu de la station d’Ibrahim et récitez:
id: Setelah menyelesaikan tawaf sebanyak tujuh putaran mengelilingi Ka'bah, laki-laki hendaknya menutup kembali pundak kanannya. Kemudian pergilah menuju Maqam Ibrahim sambil membaca:
ru: Завершив семикратный обход Каабы, мужчина прикрывает правое плечо. Затем направьтесь к месту стояния Ибрахима и произнесите:
tr: Kâbe etrafında yedi turu tamamladıktan sonra, erkekler sağ omuzlarını kapatır. Sonra İbrahim makamına yönelin ve şunu söyleyin:

# Place of standing of Ibrahim
source: Wa-ttahizu mim-maqomi Ibrohima musollya. And take, [O believers], from the standing place of Ibrahim a place of prayer» (Surah Al-Baqarah, verse 125). If possible, at the Station of Ibrahim or any place in the Sacred Mosque, perform two rak'ahs of prayer. Remember to place a barrier in front of you so that no one passes between you and the barrier. In the first rak'ah after reciting Surah 1 «Al-Fatihah = The Opening», recite Surah 109 «Al-Kafirun = The Disbelievers», and in the second rak'ah after Surah «Al-Fatihah», recite Surah 112 «Al-Ikhlas = The Purity of Faith». After completing the prayer, head to the Zamzam water source.
ar: سورة البقرة، الآية 125. إذا أمكن، صلِّ ركعتين خلف مقام إبراهيم أو في أي مكان داخل المسجد الحرام. لا تنسَ وضع سترة أمامك بحيث لا يمر أحد بينك وبينها. في الركعة الأولى بعد سورة الفاتحة، اقرأ سورة الكافرون (109)، وفي الركعة الثانية بعد سورة الفاتحة، اقرأ سورة الإخلاص (112). بعد الانتهاء من الصلاة، توجه إلى ماء زمزم.
de: Wa-ttahizu mim-maqomi Ibrohima musollya «Nehmt Ibrahims Standort als Gebetsplatz!» (Surah Al-Baqarah, Vers 125). Wenn möglich, verrichte zwei Rak'at-Gebete an der Stelle von Ibrahim oder an einem beliebigen Ort in der Heiligen Moschee. Vergiss nicht, eine Barriere vor dir aufzustellen, damit niemand zwischen dir und der Barriere hindurchgeht. In der ersten Rak'ah nach der Rezitation von Surah Al-Fatiha, lies Surah Al-Kafirun (Sure 109). In der zweiten Rak'ah nach der Rezitation von Surah Al-Fatiha, lies Surah Al-Ikhlas (Sure 112). Nach dem Gebet begebe dich zur Quelle des Zamzam-Wassers.
fr: Wattakhidhu mim maqomi Ibrohima musolla «Et prenez le lieu de la station d’Ibrahim comme lieu de prière» (Sourate 2 «Al-Baqara = La Vache», verset 125). Si possible, priez deux rak’ahs derrière le lieu de la station d’Ibrahim ou à tout autre endroit dans la Mosquée Sacrée. Assurez-vous de placer une barrière devant vous afin que personne ne passe entre vous et cette barrière. Lors du premier rak’ah après la sourate 1 «Al-Fatiha = L’Ouverture», récitez la sourate 109 «Al-Kafirun = Les Mécréants», et au deuxième rak’ah après la sourate «Al-Fatiha», récitez la sourate 112 «Al-Ikhlas = La Pureté de la foi». Après avoir terminé la prière, dirigez-vous vers la source d’eau de Zamzam.
id: Wat-takhidzu mim-maqaami Ibraahiima mushallaa. «Jadikanlah Maqam Ibrahim sebagai tempat shalat.» (QS. Al-Baqarah [2]: 125). Jika memungkinkan, lakukanlah shalat dua rakaat di belakang Maqam Ibrahim. Jika sulit, maka lakukanlah shalat dua rakaat tersebut di mana saja di dalam Masjidil Haram. Jangan lupa meletakkan pembatas (sutrah) di hadapanmu agar tidak ada orang lewat di antara dirimu dan pembatas tersebut. Pada rakaat pertama setelah membaca Surah Al-Fatihah, bacalah Surah Al-Kafirun (109), dan pada rakaat kedua setelah membaca Surah Al-Fatihah, bacalah Surah Al-Ikhlas (112). Setelah menyelesaikan shalat dua rakaat ini, pergilah menuju sumur Zamzam.
ru: Ва-ттахизу мим-макъоми Иброhима мусолля «Изберите же место [стояния] Ибрахима местом моления» (сура 2 «Аль-Бакара = Корова», аят 125). При возможности за местом стояния Ибрахима либо же в любом месте Заповедной мечети совершите два рак‘ата намаза. Не забудьте установить перед собой преграду так, чтобы между вами и этой преградой никто не проходил. В первом рак‘ате после суры 1 «Аль-Фатиха = Открывающая» прочтите суру 109 «АльКяфирун = Неверующие», а во втором рак‘ате после суры «АльФатиха» прочтите суру 112 «Аль-Ихляс = Очищение веры». Завершив намаз, отправьтесь к источнику с водой Замзам.
tr: Wa-ttahizu mim-maqomi Ibrohima musollya. «Ve İbrahim’in makamını namaz yeri edinin» (Bakara Suresi, 125. ayet). Eğer mümkünse, İbrahim Makamı’nda veya Mescid-i Haram’ın herhangi bir yerinde iki rekât namaz kılın. Önünüze bir engel koymayı unutmayın ki kimse sizinle engel arasından geçmesin. İlk rekâtta 1. sure «Al-Fatihah = Fatiha Suresi» okunduktan sonra 109. sure «Al-Kafirun = Kâfirun Suresi» okunur, ikinci rekâtta «Al-Fatihah» okunduktan sonra 112. sure «Al-Ikhlas = İhlas Suresi» okunur. Namazı tamamladıktan sonra Zemzem suyu kaynağına yönelin.

source: Drinking Zamzam water.
ar: شرب ماء زمزم.
de: Trinken des Zamzam-Wassers.
fr: Boire de l’eau de Zamzam.
id: Meminum Air Zamzam.
ru: Питье воды Замзам.
tr: Zemzem Suyu İçme.

# Zamzam text
source: Drink water and pour it over your head. Jabir (may Allah be pleased with him) narrated: «The Prophet (peace be upon him) went to the well of Zamzam, drank from it and poured it over his head.» This hadith is authentic, and it is reported in Ahmad (3/394), Ibn Khuzaymah (4/305). The authenticity of the hadith is confirmed by az-Zarkashi, Badr al-Din al-Ayni, and Shu'ayb al-Arnaut. See «Umdat al-Qari» (9/227), «Hashiya 'ala al-Manasik» (p. 263), «Tahridj al-Musnad» (15243). From the words of Jabir (may Allah be pleased with him), it is reported that the Messenger of Allah (peace be upon him) said: «The water of Zamzam helps to achieve what it is drunk for.» This hadith is reported in Ahmad (3/357), Ibn Majah (3062), and Al-Hakim (1739). The authenticity of the hadith has been confirmed by scholars such as Sufyan ibn 'Uyaynah, Al-Munziri, Ad-Dumyati, Ibn Al-Qayyim, Az-Zarkashi, Ibn Hajar, and Al-Albani. See «Al-Mudjalasa» (509), «Al-Matjar Ar-Rabih» (982), «Zadul-Ma'ad» (4/393), «Al-Maqasid Al-Hasanah» (928), «Faidul-Qadir» (7759), and «Sahih At-Targhib» (1165). Ash-Shawkani said: «This hadith contains evidence that drinking Zamzam water is beneficial for the drinker, no matter what intention they have, whether it is for the affairs of this world or the Hereafter. The words 'it serves the purpose for which it is drunk' are general in meaning.» See «Nayl al-Awtar» (5/105). An-Nawawi said: «The meaning of this hadith is that whoever drinks this water for a specific purpose, will attain it. Truly, scholars and righteous people have tried this to achieve their needs, whether in this world or the Hereafter, and they have received it by the grace of Almighty Allah.» See «Tahzib al-asma wa al-lughat» (3/139).
ar: اشرب الماء وصبّه على رأسك. جابر رضي الله عنه قال: «إن النبي ﷺ توجه إلى بئر زمزم، فشرب منها وصبّ على رأسه». (أخرجه أحمد (٣٩٤/٣)، وابن خزيمة (٣٠٥/٤)). وصحّح الحديث كل من الزركشي وبدر الدين العيني وشعيب الأرناؤوط. انظر: «عمدة القاري» (٢٢٧/٩)، «حاشية على المناسك» (٢٦٣)، «تخريج المسند» (١٥٢٤٣). عن جابر رضي الله عنه قال: قال رسول الله ﷺ: «ماء زمزم لما شرب له». (أخرجه أحمد (٣٥٧/٣)، وابن ماجه (٣٠٦٢)، والحاكم (١٧٣٩)). وصحح الحديث كل من سفيان بن عيينة، المنذري، الدمياطي، ابن القيم، الزركشي، ابن حجر، والألباني. انظر: «المجالسة» (٥٠٩)، «المتجر الرابح» (٩٨٢)، «زاد المعاد» (٣٩٣/٤)، «المقاصد الحسنة» (٩٢٨)، «فيض القدير» (٧٧٥٩)، «صحيح الترغيب» (١١٦٥). قال الشوكاني: «في الحديث دليل على أن شرب ماء زمزم نافع للشخص لأي غرض شربه له، سواء أكان ذلك متعلقًا بأمور الدنيا أم الآخرة. فكلمات: «لما شرب له» عامة». انظر: «نيل الأوطار» (١٠٥/٥). وقال النووي: «معنى الحديث أن الشارب لهذه الماء لشيء معين يحصل عليه. وقد جرب العلماء والصالحون ذلك لحاجاتهم المتعلقة بالدنيا والآخرة، فحصلوا عليها بفضل الله عز وجل». انظر: «تهذيب الأسماء واللغات» (١٣٩/٣).
de: Trinke das Wasser und gieße es dir auf den Kopf. Djabir (möge Allah mit ihm zufrieden sein) berichtete: «Der Prophet (Friede und Segen Allahs seien auf ihm) begab sich zum Brunnen von Zamzam, trank daraus und goss sich das Wasser über den Kopf.» Überliefert von Ahmad (3/394) und Ibn Huzayma (4/305). Die Authentizität dieses Hadiths wurde von Az-Zarkashi, Badrud-Din al-'Ayni und Shu'aib al-Arna'ut bestätigt. Siehe 'Umdatul-Qari (9/227), Hashiya 'ala al-Manasik (S. 263) und Tahdhib al-Musnad (15243) Nach Jabir (möge Allah mit ihm zufrieden sein) sagte der Gesandte Allahs (Frieden und Segen Allahs seien auf ihm): «Wasser von Zamzam fördert die Erfüllung dessen, wofür es getrunken wird». Ahmad (3/357), Ibn Majah (3062), al-Hakim (1739). Die Authentizität des Hadiths wurde von Sufyan ibn Uyaynah, al-Munziri, ad-Dumyati, Ibn al-Qayyim, az-Zarkashi, Ibn Hajar und al-Albani bestätigt. Siehe «al-Mudhallasa» (509), «al-Matjar ar-Rabih» (982), «Zadul-ma'ad» (4/393), «al-Maqasid al-Hasana» (928), «Faidul-Qadir» (7759), «Sahih at-Targhib» (1165). Al-Shawkani sagte: «In diesem Hadith ist der Beweis enthalten, dass das Trinken von Zamzam-Wasser dem Trinker Nutzen bringt, egal mit welcher Absicht er es trinkt, ob es sich um Angelegenheiten in dieser Welt oder im Jenseits handelt. Denn die Worte: «Fördert das Erreichen dessen, wofür es getrunken wird» sind allgemein gehalten.» Siehe «Nail al-Autar» (5/105). Al-Nawawi sagte: «Die Bedeutung dieses Hadiths besteht darin, dass jemand, der dieses Wasser für etwas Bestimmtes trinkt, dies auch erhält. Wahrlich, Gelehrte und Rechtschaffene haben dies ausprobiert, um ihre Bedürfnisse in Bezug auf diese Welt und das Jenseits zu erfüllen, und haben dies durch die Gnade des Allmächtigen Allah erreicht.» Siehe «Tahzib al-Asma' wa-l-Lughaat» (3/139).
fr: Buvez de l’eau et versez-en sur votre tête. Jabir (qu’Allah soit satisfait de lui) a rapporté: «Le Prophète (que la paix et les bénédictions d’Allah soient sur lui) s’est dirigé vers le puits de Zamzam, il en a bu de l’eau et s’en est versé sur la tête.» Ahmad (3/394), Ibn Khuzaymah (4/305). L’authenticité du hadith a été confirmée par Az-Zarkashi, Badr ad-Din al-‘Ayni, Shou’aib al-Arna’ut. Voir «‘Umdatul-Qari» (9/227), «Hashiyah ‘ala al-Manasik» (p. 263), «Takhrij al-Musnad» (15243). Selon Jabir (qu’Allah soit satisfait de lui), il est rapporté que le Messager d’Allah (que la paix et les bénédictions d’Allah soient sur lui) a dit: «L’eau de Zamzam aide à accomplir ce pour quoi elle est bue.» Ahmad (3/357), Ibn Majah (3062), al-Hakim (1739). L’authenticité du hadith a été confirmée par Sufyan ibn ‘Uyaynah, al-Munziri, ad-Dumiyati, Ibn al-Qayyim, Az-Zarkashi, Ibn Hajar, al-Albani. Voir “al-Mujalasa” (509), “al-Matjar ar-Rabih” (982), “Zadul-Ma’ad” (4/393), “al-Maqasid al-Hasana” (928), “Faydul-Qadir” (7759), “Sahih at-Targhib” (1165). Ash-Shawkani a dit: «Ce hadith prouve que boire de l’eau de Zamzam est bénéfique pour celui qui la boit, quelle que soit l’intention avec laquelle il la boit, que ce soit pour les affaires de ce monde ou pour celles de l’au-delà. En effet, les mots: ”Elle aide à accomplir ce pour quoi elle est bue„ sont généraux.» Voir “Nayl al-Awtar” (5/105). An-Nawawi a dit: «Le sens de ce hadith est que celui qui boit cette eau avec une intention particulière obtient ce qu’il a demandé. En vérité, les savants et les pieux ont expérimenté cela pour satisfaire leurs besoins liés à ce monde et à l’au-delà, et ils les ont obtenus par la grâce d’Allah Tout-Puissant.» Voir “Tahdhib al-Asma wa-l-Lughat” (3/139).
id: Minumlah air Zamzam dan siramkanlah sebagiannya ke kepala. Jabir (semoga Allah meridainya) meriwayatkan: “Nabi (shallallahu 'alaihi wa sallam) menuju sumur Zamzam, lalu beliau minum air Zamzam dan menyiramkan sebagiannya ke atas kepala beliau.” (HR. Ahmad [3/394], Ibnu Khuzaimah [4/305]). Hadis ini telah dinyatakan sahih oleh Az-Zarkasyi, Badruddin al-'Aini, dan Syu'aib al-Arnauth. Lihat juga: ‘Umdatul-Qari (9/227), Hasyiyah ‘ala al-Manasik (hlm. 263), Takhrij al-Musnad (15243). Dari Jabir (semoga Allah meridainya) juga diriwayatkan bahwa Rasulullah (shallallahu 'alaihi wa sallam) bersabda: “Air Zamzam bermanfaat sesuai dengan niat orang yang meminumnya.” (HR. Ahmad [3/357], Ibnu Majah [3062], Al-Hakim [1739]). Hadis ini dinyatakan sahih oleh Sufyan bin 'Uyainah, Al-Mundziri, Ad-Dumyathi, Ibnu al-Qayyim, Az-Zarkasyi, Ibnu Hajar, dan Al-Albani. Lihat juga: Al-Mujalasah (509), Al-Matjar ar-Rabih (982), Zadul Ma'ad (4/393), Al-Maqashid al-Hasanah (928), Faidhul-Qadir (7759), Shahih at-Targhib (1165). Asy-Syaukani berkata: “Dalam hadis ini terdapat dalil bahwa minum air Zamzam memberikan manfaat kepada peminumnya sesuai dengan niat apa pun yang diniatkannya, baik urusan dunia maupun akhirat. Karena sabda Nabi ‘bermanfaat sesuai niat orang yang meminumnya’ bersifat umum.” (Nailul Authar, 5/105). Imam An-Nawawi mengatakan: “Makna hadis ini adalah bahwa siapa pun yang minum air ini dengan tujuan tertentu, maka ia akan memperolehnya. Sesungguhnya para ulama dan orang-orang saleh telah membuktikan manfaat air Zamzam dalam memenuhi kebutuhan duniawi maupun ukhrawi mereka, dan mereka memperolehnya atas rahmat Allah Ta'ala.” (Tahdzib al-Asma wal-Lughat, 3/139).
ru: Выпейте воду и полейте её себе на голову. Джабир (да будет доволен им Аллах) рассказывал: “Пророк (мир ему и благословение Аллаха) направился к колодцу Замзам, выпил из него воды и полил её себе на голову”. Ахмад (3/394), Ибн Хузайма (4/305). Достоверность хадиса подтвердили аз-Заркаши, Бадруддин аль-‘Айни, Шу’айб аль-Арнаут. См. «‘Умдатуль-къари» (9/227), «Хашия ‘аля аль-Манасик» (стр. 263), «Тахридж аль-Муснад» (15243). Со слов Джабира (да будет доволен им Аллах) сообщается, что Посланник Аллаха (мир ему и благословение Аллаха) сказал: «Вода Замзам способствует осуществлению того, для чего её пьют». Ахмад (3/357), Ибн Маджах (3062), аль-Хаким (1739). Достоверность хадиса подтвердили Суфьян ибн ‘Уяйна, аль-Мунзири, ад-Думьяты, Ибн аль-Къайим, аз-Заркаши, Ибн Хаджар, аль-Альбани. См. “аль-Муджаляса” (509), “аль-Матджар ар-рабих” (982), “Задуль-ма’ад” (4/393), “аль-Макъасыд аль-хасана” (928), “Файдуль-Къадир” (7759), “Сахих ат-Таргъиб” (1165). Сказал аш-Шаукани: “В данном хадисе содержится доказательство на то, что питьё воды Замзам приносит пользу пьющему, с каким бы намерением он ни пил её, будь это дела мира этого или мира Вечного. Ведь слова: «Способствует осуществлению того, ради чего её пьют» являются обобщёнными”. См. “Нейлюль-аутар” (5/105). Сказал ан-Науауи: “Смысл этого хадиса в том, что пьющий эту воду для чего-то конкретного, приобретает это. Воистину, испробовали это учёные и праведники для достижения своих нужд, связанных с миром этим и миром Вечным и получили это по милости Всевышнего Аллаха”. См. “Тахзиб аль-асма уа-ллюгъат” (3/139).
tr: Suyu için ve başınıza dökün. Cabir (radıyallahu anh) şöyle anlatmıştır: “Peygamber (sallallahu aleyhi ve sellem) Zemzem kuyusuna yöneldi, ondan su içti ve başına döktü.” (Ahmed 3/394), (İbn Huzeyme 4/305). Hadisin sahih olduğunu ez-Zerkeşî, Bedruddin el-Aynî, Şuayb el-Arnaût onaylamıştır. Bkz. «Umdetü’l-Kârî» (9/227), «Haşiye ‘alâ’l-Menâsik» (s. 263), «Tahric el-Müsned» (15243). Cabir’den (radıyallahu anh) rivayet edildiğine göre, Allah Resulü (sallallahu aleyhi ve sellem) şöyle buyurdu: «Zemzem suyu, hangi niyetle içilirse ona vesile olur.» (Ahmed 3/357), (İbn Mace 3062), (el-Hâkim 1739). Hadisin sahih olduğunu Süfyan ibn Uyeyne, el-Münzirî, ed-Dümyâtî, İbn Kayyim, ez-Zerkeşî, İbn Hacer, el-Elbânî onaylamıştır. Bkz. “el-Mücâlasa” (509), “el-Metcar er-Râbih” (982), “Zâdü’l-Meâd” (4/393), “el-Makâsıdü’l-Hasene” (928), “Feyzü’l-Kadîr” (7759), “Sahîh et-Terğîb” (1165). eş-Şevkânî şöyle demiştir: “Bu hadis, Zemzem suyunun hangi niyetle içilirse içilsin içen kişiye fayda sağlayacağına delildir. Çünkü ‘hangi niyetle içilirse ona vesile olur’ ifadesi genel bir hüküm içermektedir.” Bkz. “Neylü’l-Evtâr” (5/105). en-Nevevî şöyle demiştir: “Bu hadisin anlamı şudur ki, bir kişi Zemzem suyunu belirli bir niyetle içerse, o niyetine ulaşır. Gerçekten de ilim ehli ve salih kişiler bu suyu dünya ve ahiret işlerinde dileklerine ulaşmak için içmişler ve Allah’ın lütfuyla istediklerine ulaşmışlardır.” Bkz. “Tehzîb el-Esma ve’l-Luğât” (3/139).

source: Return to the Black Stone.
ar: العودة إلى الحجر الأسود.
de: Kehrt zurück zum schwarzen Stein.
fr: Retournez à la Pierre Noire.
id: Kembali ke Hajar Aswad.
ru: Возврат к Черному камню.
tr: Hacerü'l-Esved'e Dönüş.

# Return to the Black Stone, recite the Takbir.
source: Return to the Black Stone, saying takbir, and touch it with your hand as explained earlier, or point to it with your hand and say takbir. Allah is Great.
ar: ارجع إلى الحجر الأسود وكبّر، ولمسه كما تم توضيحه سابقاً، أو أشر إليه بيدك وكبّر.
de: Kehrt zum Schwarzen Stein zurück, sagt Takbir und berührt ihn wie zuvor erklärt wurde. Oder zeigt mit der Hand darauf und sagt Takbir. Allah ist groß.
fr: Retournez à la Pierre Noire, récitez le Takbir et touchez-la comme expliqué précédemment. Sinon, pointez-la de la main et récitez le Takbir. Allah est Grand.
id: Kembalilah menuju Hajar Aswad sambil mengucapkan takbir, lalu sentuh dan ciumlah sebagaimana telah dijelaskan sebelumnya. Jika tidak memungkinkan, cukup tunjukkan ke arahnya dengan tangan sambil mengucapkan takbir. Allah Maha Besar.
ru: Возвратитесь к Чёрному камню, произносите такбир и прикаснитесь к нему так же, как было разъяснено ранее. Или укажите на него рукой и произнесите такбир. Аллах Велик.
tr: Hacerü'l-Esved'e dönün, tekbir getirin ve daha önce açıklandığı gibi ona dokunun. Veya ona elinizle işaret edin ve tekbir getirin. Allah en büyüktür.

source: Safa and Marwa
ar: الصفا والمروة
de: Safa und Marwa
fr: As-Safa et Al-Marwa
id: Safa dan Marwah
ru: Сафа и Марва
tr: Safa ve Merve

# Head towards the hill of Safa
source: Go to the hill of Safa to perform the seven rounds of the ritual walk (sa‘y) between the hills of Safa and Marwa. Begin the sa‘y at the hill of Safa. As you approach Safa, recite:
ar: توجه إلى جبل الصفا لأداء السعي بين الصفا والمروة سبع مرات. ابدأ السعي من الصفا. عند الاقتراب من الصفا، اقرأ:
de: Gehen Sie zum Hügel von Safa, um die sieben Runden zwischen den Hügeln von Safa und Marwa (Sa'y) zu absolvieren. Beginnen Sie den Sa'y am Hügel von Safa. Beim Annähern an Safa, liest folgendes:
fr: Dirigez-vous vers la colline de Safa pour effectuer le rituel des sept passages entre les collines de Safa et Marwa (Sa’i). Commencez le Sa’i à la colline de Safa. En vous approchant de Safa, récitez:
id: Bergeraklah menuju bukit Safa untuk melaksanakan Sa'i (berjalan antara Safa dan Marwah) sebanyak tujuh kali. Mulailah Sa'i dari bukit Safa. Ketika mendekati bukit Safa, bacalah:
ru: Направьтесь к холму Сафа для совершения семикратного ритуального прохождения между холмами Сафа и Марва (са‘й). Начните са‘й у холма Сафа. Приблизившись к Сафе, прочтите:
tr: Safa ve Merve tepeleri arasında yedi kez gerçekleştirilen sa‘y ibadetini yerine getirmek için Safa tepesine gidin. Sa‘y ibadetine Safa tepesinden başlayın. Safa'ya yaklaşırken şu ayeti okuyun:

# Surah Al-Baqarah, verse 158.
source: Inna Ssofaa wal-Marwata min sha’aaa’iril laah, faman hajjal Baita awi’tamaro falaa junaaha ‘alaihi ayyatt´owwafa bihimaa, wa man tat´owwa’a hoyron fa-inna-LLAha Shakirun ´alim. «Indeed, as-Safa and al-Marwah are among the symbols of Allah. So whoever makes Hajj to the House or performs 'umrah - there is no blame upon him for walking between them. And whoever volunteers good - then indeed, Allah is appreciative and Knowing.» (Surah Al-Baqarah, verse 158. Then say:
ar: ثم قل:
de: Inna Ssofaa wal-Marwata min sha’aaa’iril laah, faman hajjal Baita awi’tamaro falaa junaaha ‘alaihi ayyatt´owwafa bihimaa, wa man tat´owwa’a hoyron fa-inna-LLAha Shakirun ´alim. «Wahrlich, As Safa und Al-Marwa gehören zu den Kultstätten Allahs; und wer zu dem Hause pilgert oder die `Umra vollzieht, für den ist es kein Vergehen, wenn er zwischen beiden hin- und herschreitet. Und wenn einer freiwillig Gutes tut, so ist Allah Erkenntlich, Allwissend.» (Surah Al-Baqarah, verse 158.) Dann sagen Sie:
fr: Inna-s-Sofa wal-Marwata min sha'airi-Llah, fa man hajjal-bayta awi'tamaro fala junaha 'alayhi ay yatt`owwafa bihima, wa man tatowwa'a khoyron fa inna-Llaha Shakurun 'Alim. «En vérité, As-Safa et Al-Marwa font partie des rites prescrits par Allah. Celui qui fait le pèlerinage à la Kaaba ou la ‘Umra ne commet aucun péché en passant entre eux. Et quiconque fait de son plein gré une bonne action, Allah en est Reconnaissant et Omniscient.» (Sourate «La Vache», verset 158) Ensuite, dites:
id: Innaṣ-ṣafā wal-marwata min sya‘ā`irillāh, faman ḥajja l-baita awi'-tamara falā junāḥa ‘alaihi ay-yaṭṭawwafa bihimā, wa man taṭawwa‘a khairan fa innallāha syākirun ‘alīm. «Sesungguhnya Safa dan Marwah adalah sebagian dari syi’ar-syi’ar Allah. Maka barangsiapa beribadah haji ke Baitullah atau berumrah, maka tidak ada dosa baginya mengerjakan Sa'i antara keduanya. Barangsiapa yang dengan sukarela mengerjakan kebajikan, maka sesungguhnya Allah Maha Mensyukuri lagi Maha Mengetahui.» (QS. Al-Baqarah [2]: 158) Kemudian ucapkanlah:
ru: Инна-с-Софа валь-Марвата мин ша'аири-ЛлЯh, фаман хьаджжа-ль-байта ави'-тамаро фаля джунахьа 'аляйhи айй-йат'т'оввафа биhима, ва ман тат'ова'а хойран фа-инна-ЛЛоhа Шакирун 'алим. «Воистину, ас-Сафа и аль-Марва – одни из обрядовых знамений Аллаhа. Кто совершает хадж к Ка’бе или ‘умру, тот не совершит греха, если пройдет между ними. А если кто добровольно совершает доброе дело, то ведь Аллаh – Признательный, Знающий.» (сура «‎Корова», аят 158) Затем скажите:
tr: Inna Ssofaa wal-Marwata min sha’aaa’iril laah, faman hajjal Baita awi’tamaro falaa junaaha ‘alaihi ayyatt´owwafa bihimaa, wa man tat´owwa’a hoyron fa-inna-LLAha Shakirun ´alim. «Şüphesiz ki Safa ve Merve, Allah’ın sembollerindendir. Bu nedenle, kim Beytullah’a hac veya umre için gelirse, onların arasında yürüyerek geçmesinde kendisine bir günah yoktur. Kim gönülden bir iyilik yaparsa, şüphesiz Allah, şükrün karşılığını verendir, bilendir.» (Bakara Suresi, 158. Ayet). Sonra şunu söyleyin:

# We begin with that string
source: Nabdau bima badaa-Llahu bihi «We begin with that with which Allah began.» Ascend to the hill of Safa, turn your face towards the Kaaba, and say:
ar: اصعد على جبل الصفا، واجه الكعبة وقل:
de: Nabdau bima badaa-Llahu bihi. «Wir beginnen mit dem, womit Allah begonnen hat.» Steigen Sie auf den Hügel von Safa und wenden Sie Ihr Gesicht zur Kaaba. Sagen Sie dann:
fr: Nabdau bima bada Allohu bihi «Nous commençons par ce qu’Allah a commencé» Montez sur la colline de Safa, tournez-vous vers la Kaaba et dites:
id: Nabda`u bimā bada`allāhu bihi. «Kami memulai dengan apa yang telah dimulai oleh Allah.» Naiklah ke bukit Safa, lalu menghadaplah ke arah Ka'bah dan ucapkan:
ru: Набдау бима бадаа-Ллоhу биhи «Мы начинаем с того, с чего начал Аллах» Поднимитесь на холм Сафа, повернитесь лицом к Каабе и произнесите:
tr: Nabdau bima badaa-Llahu bihi «Biz, Allah’ın başladığı ile başlıyoruz.» Safa tepesine çıkın, yüzünüzü Kâbe’ye çevirin ve şu zikri okuyun:
