//
//  UsefulTex.swift
//  umra
//
//  Created by Saydulayev on 17.09.24.
//

import Foundation

struct EtiquetteManners {
    static let text1 = """
    Самым важным из того, чем обязан человек, совершающий хадж и ’умру, является искренность перед Аллахом. Он должен избавиться от показухи и желания славы, дабы получить вознаграждение за этот хадж и эту ’умру.
    
    Сообщается со слов Абу Хурейры, да будет доволен им Аллах, что посланник Аллаха, да благословит его Аллах и приветствует, сказал: «Аллах Всевышний сказал: "Я совершенно не нуждаюсь в том, чтобы Мне придавали сотоварищей, если же кто-то совершит что-либо не только ради Меня, но и ради кого-то другого, Я откажусь и от него, и от его многобожия!"». Муслим, 2985.
    
    Также сообщается, что посланник Аллаха, да благословит его Аллах и приветствует, сказал: «О Аллах, (сделай этот) хадж таким, в котором нет ни показухи, ни желания славы!» ибн Маджах, 2890.
    """

    static let text2 = """
    Человек, желающий совершить хадж и ’умру, должен проявить усердие в изучении законоположений, связанных с хаджем и ’умрой, чтобы совершить их на основе знания.
    """

    static let text3 = """
    Человек, совершающий хадж и ’умру, должен постараться выбрать самых лучших спутников на время пути в хадж, дабы взять от них пользу, как в знании, так и в поведении.
    
    Сообщается со слов Абу Мусы аль-Аш’ари, да будет доволен им Аллах, что посланник Аллаха, да благословит его Аллах и приветствует, сказал: «Пример праведного спутника и плохого, подобно продавцу мускуса и раздувающему кузнечный мех. Что касается продавца мускуса, то либо он сделает тебе подарок, либо ты купишь у него что-нибудь, либо ощутишь исходящий от него аромат. Что же касается раздувающего мех, то либо он прожжет твою одежду, либо ты ощутишь исходящее от него зловоние». аль-Бухари 5534, Муслим 2628.
    """

    static let text4 = """
    Человек, совершающий хадж и ’умру, должен иметь при себе определенное количество денег, чтобы не нуждаться в деньгах других людей.
    
    Сообщается со слов Абу Са’ида аль-Худри, да будет доволен им Аллах, что пророк, да благословит его Аллах и приветствует, сказал: «Того, кто станет стремиться к воздержанности, Аллах приведёт к воздержанности, того, кто станет пытаться обходиться своими силами, Аллах избавит от необходимости обращаться к другим». аль-Бухари, 1469; Муслим, 1053.
    """
    
    static let text5 = """
    Человек, совершающий хадж и ’умру, должен украшаться благородными нравами и обращаться с другими людьми наилучшим образом.
    
    Сообщается со слов Абу Зарра, да будет доволен им Аллах, что пророк, да благословит его Аллах и приветствует, сказал: «Бойся Аллаха, где бы ты ни был! Вслед за дурным делом соверши благое, которое сотрет собой дурное, и придерживайся в отношениях с людьми наилучших нравов». ат-Тирмизи, 1987.
    
    Сообщается со слов ’Абдуллаха ибн ’Амра ибн аль-’Аса, да будет доволен Аллах им и его отцом, что пророк, да благословит его Аллах и приветствует, сказал: «Пусть же тот, кто желает, чтобы его удалили от Огня и ввели в Рай, окажется верующим в Аллаха и Последний день, когда придёт к нему смерть, и пусть обращается с людьми так же, как желает он, чтобы люди обращались с ним». Муслим, 1844.
    """
    
    static let text6 = """
    Человек, совершающий хадж и ’умру, должен занять себя поминанием Аллаха (зикром), мольбами к Нему (ду’а) и просьбами о прощении (истигъфар). Он должен оберегать свой язык от всего, кроме благих речей. Он должен занять всё свое время тем, что обернется для него благом как в мирской жизни, так и в Последней.
    
    Сообщается со слов Абу Хурейры, да будет доволен им Аллах, что посланник Аллаха, да благословит его Аллах и приветствует, сказал: «Пусть тот, кто верует в Аллаха и в Последний день, говорит благое или молчит». аль-Бухари, 6018; Муслим, 47.
    
    Сообщается со слов ибн ’Аббаса, да будет доволен Аллах им и его отцом, что посланник Аллаха, да благословит его Аллах и приветствует, сказал: «Две милости, которых лишены многие люди: здоровье и свободное время». аль-Бухари, 6412.
    """
    
    static let text7 = """
    Человек, совершающий хадж и ’умру, должен остерегаться того, чтобы обидеть других людей своим словом или поступком.
    
    Пророк, да благословит его Аллах и приветствует, сказал: «Мусульманин — это тот, кто не причиняет (другим) мусульманам вреда своим языком и своими руками». аль-Бухари, 10; Муслим, 41.
    
    Пусть мусульманин также остерегается того, чтобы навредить другим мусульманам скверным запахом сигаретного дыма, если он сам курит. И это при том, что он итак обязан оставить курение и покаяться перед Аллахом. Поистине, курение вредит здоровью и уничтожает его имущество.
    
    Мусульманину следует стараться придерживаться вышеперечисленных благих нравственных качеств всегда и везде, но особенно во время своего путешествия в хадж или ’умру.
    """
}



struct HajjUmrahVirtues {
    static let text1 = """
    О достоинстве хаджа и ’умры пришли достоверные хадисы от посланника Аллаха, да благословит его Аллах и приветствует. Приведем некоторые из них:
    
    Сообщается со слов Абу Хурейры, да будет доволен им Аллах, что посланник Аллаха, да благословит его Аллах и приветствует, сказал: «Совершение ‘умры до следующей умры служит искуплением совершенных между ними грехов, что же касается безупречного хаджа, то нет за него иного воздаяния, кроме Рая». аль-Бухари, 1773; Муслим, 1349.
    
    Сообщается со слов ибн Мас’уда, да будет доволен им Аллах, что посланник Аллаха, да благословит его Аллах и приветствует, сказал: «Совершайте хадж и ’умру регулярно, ибо они удаляют бедность и грехи подобно тому, как кузнечные меха удаляют шлаки с железа, золота и серебра. А за безупречный хадж нет иной награды, кроме Рая». ат-Тирмизи, 810; ан-Насаи, 2631.
    
    Сообщается со слов ибн ’Аббаса, да будет доволен им Аллах и его отцом, что посланник Аллаха, да благословит его Аллах и приветствует, сказал: «Совершайте хадж и ’умру регулярно, ибо они удаляют бедность и грехи подобно тому, как кузнечные меха удаляют шлаки с железа». ан-Насаи, 2630.
    """
    
    static let text2 = """
    Сообщается со слов матери правоверных ‘Аиши, да будет доволен ею Аллах, что однажды она сказала: «О посланник Аллаха, мы считаем наилучшим делом джихад, так не принять ли нам в нём участие?» Пророк, да благословит его Аллах и приветствует, ответил: «Нет! Наилучшим джихадом для вас (женщин) является безупречный хадж». аль-Бухари, 1520.
    
    Также в другой версии сообщается, что ‘Аиша, да будет доволен ею Аллах, сказала: «О посланник Аллаха, должны ли женщины совершать джихад?» Пророк, да благословит его Аллах и приветствует, ответил: «Они должны совершать джихад, в котором нет сражения, а это хадж и ’умра». ибн Маджах, 2901.
    """
    
    static let text3 = """
    Сообщается со слов Абу Хурейры, да будет доволен им Аллах, что пророк, да благословит его Аллах и приветствует, сказал: «Тот, кто совершит хадж ради Аллаха, не приблизившись к своей жене и не совершив ничего греховного и недостойного, вернётся домой таким же, каким был он в тот день, когда родила его мать». аль-Бухари, 1521; Муслим, 1350.
    
    Сообщается также, что пророк, да благословит его Аллах и приветствует, сказал ’Амру ибн аль-’Асу, да будет доволен им Аллах: «Разве тебе не известно, что ислам уничтожает всё, что было прежде, и хиджра уничтожает всё, что было прежде, и хадж уничтожает всё, что было прежде?» Муслим, 121.
    
    Безупречный хадж, (о котором сказано в вышеперечисленных хадисах), это такой хадж, который соответствует сунне посланника Аллаха, да благословит его Аллах и приветствует.
    """
    
    
    static let text4 = """
    Сообщается со слов Джабира, да будет доволен им Аллах, что пророк, да благословит его Аллах и приветствует, сказал: «Перенимайте от меня ваши религиозные обряды, ибо я не знаю — может быть, после этого моего хаджа я уже никогда не совершу паломничества». Муслим, 1297.
    
    В другой версии этого хадиса сообщается, что пророк, да благословит его Аллах и приветствует, сказал: «О люди, перенимайте от меня ваши религиозные обряды, ибо я не знаю — может быть, я не совершу больше хаджа после этого года». ан-Насаи, 3062.
    """
}



struct HajjUmrahObligation {
    static let obligationEvidence = """
    Совершение хаджа и ’умры обязательно один раз в течении жизни, а кто совершит их больше одного раза, то это уже будет считаться добровольным поклонением.
    
    Также хадж и ’умра могут стать обязательными после совершения обета (назра). Если человек дал обет перед Аллахом совершить хадж или ’умру, то обязательно нужно выполнить свой обет.
    
    Если человек уже начал совершать добровольный хадж или ’умру, то он обязан довести их до конца, ибо Аллах сказал: «Завершайте хадж и малое паломничество ради Аллаха». (Сура аль-Бакара, аят 196)
    
    Совершение хаджа обязательно из-за доводов из Корана и Сунны, а также по единогласному мнению мусульман (иджма’).
    Аллах Всевышний сказал: «Люди обязаны перед Аллахом совершить хадж к Дому (Каабе), если они способны проделать этот путь. Если же кто не уверует, то ведь Аллах не нуждается в мирах». (Сура али ’Имран, аят 97)
    
    Пророк, да благословит его Аллах и приветствует, сказал: “Ислам основывается на пяти (столпах): свидетельстве о том, что нет божества, достойного поклонения, кроме Аллаха, и что Мухаммад — посланник Аллаха, совершении намаза, выплате закята, совершении хаджа и соблюдении поста в Рамадане”. аль-Бухари, 8; Муслим, 16.
    А также: «(Суть) ислама заключается в том, чтобы ты засвидетельствовал, что нет божества, достойного поклонения, кроме Аллаха, и что Мухаммад - посланник Аллаха, совершал намаз, давал закят, соблюдал пост во время Рамадана и совершил хадж к Дому, если сумеешь сделать это». Муслим, 8.
    
    Также сообщается, что Абу Хурейра, да будет доволен им Аллах, сказал: «Однажды посланник Аллаха, да благословит его Аллах и приветствует, обратился к нам с проповедью и сказал: ″О люди, хадж был вменён вам в обязанность, так совершайте же его″. Один человек спросил: ″Каждый год, о посланник Аллаха?″ — однако пророк, да благословит его Аллах и приветствует, хранил молчание до тех пор, пока тот не задал свой вопрос трижды. Тогда посланник Аллаха, да благословит его Аллах и приветствует, сказал: ″Если я скажу: "Да" это непременно станет вашей обязанностью, но вы ведь не сможете выполнять её″». Муслим, 1337.
    
    И мусульмане единогласны, что хадж обязателен для того, в ком объединились все условия обязательности хаджа.
    """

    static let evidenceUmrahObligation = """
    Что же касается ’умры, то на её обязательность указывают следующие хадисы:
    
    1 — Сообщается, что ’Айша, да будет доволен ею Аллах, однажды, спросила: «О посланник Аллаха, должны ли женщины совершать джихад?» Посланник Аллаха, да благословит его Аллах и приветствует, ответил: «Да, они обязаны совершать джихад, в котором нет сражения, а это – хадж и ’умра». Ахмад, 6/165; ибн Маджах, 2901.
    Приведя этот хадис, ибн Хузейма, да смилуется над ним Аллах, сказал: «В словах пророка, да благословит его Аллах и приветствует: «…они обязаны совершать джихад, в котором нет сражения, а это – хадж и ’умра», разъяснение того, что ’умра так же обязательна, как и хадж». См. «Сахих ибн Хузеймы», хадис № 3074.

    2 — Сообщается со слов ’Умара, да будет доволен им Аллах, что посланник Аллаха, да благословит его Аллах и приветствует, сказал: «Суть Ислама заключается в том, чтобы ты засвидетельствовал, что нет божества, достойного поклонения, кроме Аллаха, и что Мухаммад - посланник Аллаха, а также совершал намаз, давал закят, совершал хадж и ’умру, совершал полное омовение после полового осквернения, а также совершал малое омовение должным образом и постился в месяц Рамадан». См. «Сахих ибн Хузеймы», хадис № 3065. А также этот хадис у ад-Даракъутни, 2/282.

    3 — Сообщается со слов Абу Разина аль-’Укъайли, что, однажды, он пришел к пророку, да благословит его Аллах и приветствует, и сказал: «О посланник Аллаха, поистине, мой отец очень стар и не может совершить ни хадж, ни ’умру, и даже не может сидеть в седле». Пророк, да благословит его Аллах и приветствует, ответил: «Соверши хадж и ’умру за своего отца». ат-Тирмизи, 930.

    4 — Сообщается со слов ас-Субейи ибн Ма’бада, что, однажды, он сказал ’Умару ибн аль-Хаттабу, да будет доволен им Аллах: «О повелитель правоверных, поистине, я был бедуином и исповедовал христианство, а затем принял Ислам. Я стремлюсь попасть на джихад, но нашел то, что хадж и ’умра являются предписанными мне. Я спросил об этом у одного человека из моего народа, и он сказал мне: ″Соверши хадж и ’умру вместе и принеси в жертву животное из того, что тебе будет облегчено″, и я совершил их вместе». Тогда ’Умар сказал: «Ты был наставлен на сунну твоего пророка, да благословит его Аллах и приветствует». Абу Дауд, 1799.
    """

    static let concludingEvidence = """
    Хадж и ’умра обязательны для того, кто имеет условия для их совершения. Мусульмане единогласны в обязательности хаджа, когда выполняются все условия. Важно отметить, что хадж и умра, которые совершаются после обета или начаты, должны быть завершены.
    """
}
